emacs/.emacs.d/init.org
-*- after-save-hook: (org-babel-tangle); -*-
# Local IspellDict: en
# Created 2017-07-15 Sat 19:15
#+TITLE: Emacs init file
#+AUTHOR: Vagner Rener
#+PROPERTY: header-args:emacs-lisp :exports code :tangle init.el :comments 
yes :results silent

the first hand.
https://github.com/technomancy/better-defaults
This time, I did not do that. Because I didn't know about it

The keyword ":tangle yes" will automatically create a better
"emacs.el" which is good for debugging Emacs

Note: for removing a package, delete it from the init.el and from the
org file, delete the build-cache.el file, delete it from the build and
repos directories

Emacs cedilla: if cedilla does not work with your emacs using
us_intl keyboard - setxkbmap us_intl - then start Emacs like so:
"LANG=C emacs &"

https://lists.gnu.org/archive/html/help-gnu-emacs/2017-07/msg00070.html

- Emacs installation:
- apt install emacs emacspeak git texlive-full
- install /usr/share/fonts/adobe_pro/ 
- put /home/vagner/.emacs.d/snippets/ inside
- /home/vagner/.emacs.d/straight/build/yasnippet-classic-snippets/ 

* straight

#+BEGIN_SRC emacs-lisp

      ;;; Code:

      (add-to-list 'load-path (expand-file-name "~/.emacs.d/elpa"))

      (setq package-archives '(("gnu"           . "http://elpa.gnu.org/packages/")
                                ("melpa-stable" . "http://stable.melpa.org/packages/")
                                ("melpa"        . "http://melpa.org/packages/")
                                ("org"          . "http://orgmode.org/elpa/")))

      (package-initialize)


      (let ((bootstrap-file
               (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
              (bootstrap-version 4))
          (unless (file-exists-p bootstrap-file)
            (with-current-buffer
                (url-retrieve-synchronously
                 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
                 'silent 'inhibit-cookies)
              (goto-char (point-max))
              (eval-print-last-sexp)))
          (load bootstrap-file nil 'nomessage))

      (setq straight-enable-use-package-integration t
        straight-use-package-by-default t
        use-package-always-defer t)

      (straight-use-package 'use-package)

#+END_SRC

* use-package
  
#+BEGIN_SRC emacs-lisp

  (defun cyber/use-package-if-prehook (name _keyword pred rest state)
    (unless pred (error "predicated failed; skipping package")))

  (advice-add 'use-package-handler/:if :before 'cyber/use-package-if-prehook)

  (use-package f
    :ensure t)  ;; this will force use package keyword ":ensure" when using "use-package" 

;; https://zzamboni.org/post/my-emacs-configuration-with-commentary/

   (customize-set-variable 'use-package-always-defer t)

#+END_SRC
 
* speed up Emacs

  
#+BEGIN_SRC emacs-lisp

(setq gc-cons-threshold (* 100 1024 1024))

#+END_SRC

* Configurations 
** preamble 

*** TODO brazilian-holidays

#+BEGIN_SRC emacs-lisp

(load "~/.emacs.d/elpa/emacs-brazilian-holidays/brazilian-holidays.el")

#+END_SRC

*** portuguese-prefix

#+BEGIN_SRC emacs-lisp

(set-input-method "portuguese-prefix")

(defadvice switch-to-buffer (after activate-input-method activate)
(activate-input-method "portuguese-prefix"))

(add-hook 'text-mode-hook
  (lambda () (set-input-method "portuguese-prefix")))

#+END_SRC

*** scratch org-mode

disabled -> I spend more time in Org-mode than I do writing Elisp.

 #+BEGIN_SRC emacs-lisp

  ;;  (setq initial-major-mode 'org-mode)
      (setq initial-major-mode 'fundamental-mode)

 #+END_SRC

