emacs/.emacs.d/init.org
**** smart-hungry-delete

#+BEGIN_SRC emacs-lisp

 (use-package smart-hungry-delete
   :ensure t
   :bind (("<backspace>" . smart-hungry-delete-backward-char)
		  ("C-d" . smart-hungry-delete-forward-char))
   :defer nil ;; dont defer so we can add our functions to hooks 
   :config (smart-hungry-delete-add-default-hooks)
   )

#+END_SRC

**** always murder current buffer

Doing C-x k should kill the current buffer at all times, we have ibuffer for more sophisticated thing.

#+BEGIN_SRC emacs-lisp

(defun kill-current-buffer ()
  "Kills the current buffer."
  (interactive)
  (kill-buffer (current-buffer)))
(global-set-key (kbd "C-x k") 'kill-current-buffer)

#+END_SRC

**** kill it now

Do not ask for confirmation when killing a buffer

#+BEGIN_SRC emacs-lisp

;; (setq kill-buffer-query-functions (delq 'process-kill-buffer-query-function kill-buffer-query-functions))

#+END_SRC

**** ibuffer

#+BEGIN_SRC emacs-lisp

(global-set-key (kbd "C-x b") 'ibuffer)

#+END_SRC

**** expert-mode

#+BEGIN_SRC emacs-lisp

(setq ibuffer-expert t)

#+END_SRC

**** close-all-buffers

#+BEGIN_SRC emacs-lisp

(defun close-all-buffers ()
  "Kill all buffers without regard for their origin."
  (interactive)
  (mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-s-k") 'close-all-buffers)

#+END_SRC

**** switch-window

when you have many windows, you can change around with
"C-x o"

#+BEGIN_SRC emacs-lisp

(use-package switch-window
  :ensure t
  :config
    (setq switch-window-input-style 'minibuffer)
    (setq switch-window-increase 4)
    (setq switch-window-threshold 2)
    (setq switch-window-shortcut-style 'qwerty)
    (setq switch-window-qwerty-shortcuts
        '("a" "s" "d" "f" "j" "k" "l" "i" "o"))
  :bind
    ([remap other-window] . switch-window))

#+END_SRC

**** follow window splits

#+BEGIN_SRC emacs-lisp

(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

#+END_SRC

**** battery indicator

#+BEGIN_SRC emacs-lisp

(use-package fancy-battery
  :ensure t
  :config
    (setq fancy-battery-show-percentage t)
    (setq battery-update-interval 15)
    (if window-system
      (fancy-battery-mode)
      (display-battery-mode)))

#+END_SRC

**** symon 

system monitor

#+BEGIN_SRC emacs-lisp

(use-package symon
  :ensure t
  :bind
  ("s-h" . symon-mode))

#+END_SRC

**** mark-multiple

#+begin_src emacs-lisp

(use-package mark-multiple
  :ensure t
  :bind ("C-$" . 'mark-next-like-this))

#+END_SRC

**** kill-word improved

#+BEGIN_SRC emacs-lisp

(defun cyber/kill-inner-word ()
  "Kills the entire word your cursor is in. Equivalent to 'ciw' in vim."
  (interactive)
  (forward-char 1)
  (backward-word)
  (kill-word 1))
(global-set-key (kbd "C-c i w") 'cyber/kill-inner-word)

#+END_SRC

**** copy-word improved

#+BEGIN_SRC emacs-lisp

(defun cyber/copy-whole-word ()
  (interactive)
  (save-excursion
    (forward-char 1)
    (backward-word)
    (kill-word 1)
    (yank)))
(global-set-key (kbd "C-c w c") 'cyber/copy-whole-word)

#+END_SRC

**** copy-line

#+BEGIN_SRC emacs-lisp

(defun cyber/copy-whole-line ()
  "Copies a line without regard for cursor position."
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol)))))
(global-set-key (kbd "C-c l c") 'cyber/copy-whole-line)

#+END_SRC

**** kill-line

#+BEGIN_SRC emacs-lisp 

(global-set-key (kbd "C-c l k") 'kill-whole-line)

#+END_SRC

**** pretty-mode

#+BEGIN_SRC emacs-lisp :tangle yes

(when window-system
      (use-package pretty-mode
      :ensure t
      :config
      (global-pretty-mode t)))

#+END_SRC

**** rainbow

#+BEGIN_SRC emacs-lisp

(use-package rainbow-mode
 :ensure t
 :init
  (add-hook 'prog-mode-hook 'rainbow-mode))

#+END_SRC

**** rainbow delimiters

#+BEGIN_SRC emacs-lisp

(use-package rainbow-delimiters
  :ensure t
  :init
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

#+END_SRC

**** zapping to char

#+BEGIN_SRC emacs-lisp 

(use-package zzz-to-char
  :ensure t
  :bind ("M-z" . zzz-up-to-char))

#+END_SRC

**** kill-ring

#+BEGIN_SRC emacs-lisp

(setq kill-ring-max 100)

#+END_SRC

**** popup-kill-ring

#+BEGIN_SRC emacs-lisp 

(use-package popup-kill-ring
  :ensure t
  :bind ("M-K" . popup-kill-ring))

#+END_SRC

**** persistent scratch buffer

#+BEGIN_SRC emacs-lisp 

(use-package persistent-scratch
  :config
  (persistent-scratch-setup-default))

;; a function to recreate the scratch buffer
(defun scratch ()
   "create a scratch buffer"
   (interactive)
   (switch-to-buffer-other-window (get-buffer-create "*scratch*"))
   (insert initial-scratch-message)
   (org-mode))

;; https://alhassy.github.io/init/
;; initial-scratch-message
(setq initial-scratch-message (concat
 "#+Title: 'Vagner Rener' @ 'Cyberwarrior"
    "\n# This buffer is for text that is not saved, and for Lisp evaluation."
    "\n# To create a file, visit it with 'C-x C-f' e and enter text in its buffer.\n"))

#+END_SRC

*** theme and theme-looper 

#+BEGIN_SRC emacs-lisp

      ;;  (dolist (pkgname '(theme-looper
      ;;  alect-themes
      ;;  base16-theme
      ;;  color-theme-modern
      ;;  doom-themes
      ;;  moe-theme
      ;;  ))
      ;;   (straight-use-package pkgname))

    (use-package theme-looper
     :ensure t)
    (use-package color-theme-modern
     :ensure t)
    (use-package alect-themes 
     :ensure t)
    (use-package base16-theme 
     :ensure t)
    (use-package doom-themes
     :ensure t)

;; Load a nice theme if in GUI
(when (display-graphic-p)
  (load-theme 'pok-wog t)
  )

    (global-set-key (kbd "<C-f8>") 'theme-looper-enable-random-theme)

 #+END_SRC

*** centered-window 

#+BEGIN_SRC emacs-lisp

(use-package centered-window
 :ensure t)
(require 'centered-window)
(centered-window-mode 1)
  
#+END_SRC

*** wrap lines

#+BEGIN_SRC emacs-lisp

  ;; Wrap lines without breaking the last word
  (add-hook 'org-mode-hook #'toggle-word-wrap)

#+END_SRC

** abbreviations

#+BEGIN_SRC emacs-lisp

(setq-default abbrev-mode t)
     (read-abbrev-file "~/.emacs.d/abbrev_defs")
     (setq save-abbrevs t)
     (setq save-abbrevs 'silently)

   (define-key ctl-x-map "\C-i"
  #'endless/ispell-word-then-abbrev)

    ;; "it remaps to 'C-x TAB'"
    ;; Because "C-i" is the Stumpwm TM prefix-key

(defun endless/simple-get-word ()
  (car-safe (save-excursion (ispell-get-word nil))))

(defun endless/ispell-word-then-abbrev (p)
  "Call `ispell-word', then create an abbrev for it.
With prefix P, create local abbrev. Otherwise it will
be global.
If there's nothing wrong with the word at point, keep
looking for a typo until the beginning of buffer. You can
skip typos you don't want to fix with `SPC', and you can
abort completely with `C-g'. You can edit the abbreviation
file with `edit-abbrevs`"
  (interactive "P")
  (let (bef aft)
    (save-excursion
      (while (if (setq bef (endless/simple-get-word))
		 ;; Word was corrected or used quit.
		 (if (ispell-word nil 'quiet)
		     nil ; End the loop.
		   ;; Also end if we reach `bob'.
		   (not (bobp)))
	       ;; If there's no word at point, keep looking
	       ;; until `bob'.
	       (not (bobp)))
	(backward-word)
	(backward-char))
      (setq aft (endless/simple-get-word)))
    (if (and aft bef (not (equal aft bef)))
	(let ((aft (downcase aft))
	      (bef (downcase bef)))
	  (define-abbrev
	    (if p local-abbrev-table global-abbrev-table)
	    bef aft)
	  (message "\"%s\" now expands to \"%s\" %sally"
		   bef aft (if p "loc" "glob")))
      (user-error "No typo at or before point"))))

#+END_SRC

** all-the-icons 

  M-x all-the-icons-install-fonts RET

#+BEGIN_SRC emacs-lisp

  (use-package all-the-icons
   :straight t)

  (use-package all-the-icons-dired
   :straight t)

  (use-package dired-rainbow
   :straight t)

  (use-package all-the-icons-ivy
   :straight t)


#+END_SRC

*** async

#+BEGIN_SRC emacs-lisp

(use-package async
  :ensure t
  :init (dired-async-mode 1))

#+END_SRC

** amx - a fork of smex

#+begin_src emacs-lisp 

(use-package amx
 :straight t
 :config
  (amx-mode 1))

#+end_src

** ascii art to unicode

#+BEGIN_SRC emacs-lisp

(defface aa2u-face '((t . nil))
  "Face for aa2u box drawing characters")
(advice-add #'aa2u-1c :filter-return
            (lambda (str) (propertize str 'face 'aa2u-face)))
(defun aa2u-org-brain-buffer ()
  (let ((inhibit-read-only t))
    (make-local-variable 'face-remapping-alist)
    (add-to-list 'face-remapping-alist
                 '(aa2u-face . org-brain-wires))
    (ignore-errors (aa2u (point-min) (point-max)))))
(with-eval-after-load 'org-brain
  (add-hook 'org-brain-after-visualize-hook #'aa2u-org-brain-buffer))

#+END_SRC

