emacs/.emacs.d/init.org
** company-emoji

#+BEGIN_SRC emacs-lisp

    (defun --set-emoji-font (frame)

    "Adjust the font settings of FRAME so Emacs can display emoji properly."

  (if (eq system-type 'darwin)

      ;; For NS/Cocoa

      (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") frame 'prepend)

    ;; For Linux

      (set-fontset-font t 'symbol (font-spec :family "Symbola") frame 'prepend)))

    ;; For when Emacs is started in GUI mode:

    (--set-emoji-font nil)

    ;; Hook for when a frame is created with emacsclient
    ;; see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html

    (add-hook 'after-make-frame-functions '--set-emoji-font)

#+END_SRC

** counsel - ivy - swiper

#+BEGIN_SRC emacs-lisp

(use-package counsel
 :straight t
 :bind
 (("M-y" . counsel-yank-pop)
 :map ivy-minibuffer-map
 ("M-y" . ivy-next-line)))

 (setq counsel-fzf-cmd "~/.fzf/bin/fzf -f %s")

(use-package ivy
:straight t
:diminish (ivy-mode)
:bind (("C-x b" . ivy-switch-buffer))
:config
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq ivy-count-format "%d/%d ")
(setq ivy-display-style 'fancy))

(use-package swiper
:straight t
:bind (("C-s" . swiper)
       ("C-r" . swiper)
       ("C-c C-r" . ivy-resume)
       ("M-x" . counsel-M-x)
       ("C-x C-f" . counsel-find-file))
:config
(progn
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-display-style 'fancy)
  (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
  ))

#+END_SRC

** cyber-filelist

#+BEGIN_SRC emacs-lisp

(defvar cyber-filelist nil "alist for files i need to open frequently. Key is a short abbrev string, Value is file path string.")

(setq cyber-filelist
      '(
	("init.el" . "~/.emacs.d/init.el" )
	("init.org" . "~/.emacs.d/init.org")
	("dotfiles" . "~/.dotfiles/")
	("Documents" . "~/Documents/" )
	("org~" . "~/org~/" )
	("Download" . "~/Downloads/" )
	("Music" . "~/Music/")
	("Pictures" . "~/Pictures/" )
	;; more here
	) )

(defun cyber-open-file-fast ()
  "Prompt to open a file from `cyber-filelist'.
URL 'http://ergoemacs.org/emacs/emacs_hotkey_open_file_fast.html'
Version 2015-04-23"
  (interactive)
  (let ((ξabbrevCode
	 (ido-completing-read "Open:" (mapcar (lambda (ξx) (car ξx)) cyber-filelist))))
    (find-file (cdr (assoc ξabbrevCode cyber-filelist)))))

(global-set-key (kbd "C-´") 'cyber-open-file-fast)

#+END_SRC

** cyber hydra 
   
   Window manipulation
   
#+BEGIN_SRC emacs-lisp

  (defhydra cyber-hydra-window (global-map "C-c w")
         "Commands relating to window manipulation"
         ("h" windmove-left "move left")
         ("l" windmove-right "move right")
         ("j" windmove-down "move down")
         ("k" windmove-up "move up")
         ("q" delete-window "delete window")
         ("Q" kill-buffer-and-window "kill buffer, delete window")
         ("H" cyber-move-splitter-left "move splitter left")
         ("L" cyber-move-splitter-right "move splitter right")
         ("J" cyber-move-splitter-down "move splitter down")
         ("K" cyber-move-splitter-up "move splitter up")
         ("b" balance-windows)
         ("|" cyber-window-toggle-split-direction)
         ("s" split-window-below "split window (below)")
         ("v" split-window-right "split window (right)")
         (";" ace-window "select window" :exit t))

#+END_SRC

** debian stuff

#+BEGIN_SRC emacs-lisp

 (use-package debian-el
   :straight t
   :defer t)

#+END_SRC

** default browser 

#+BEGIN_SRC emacs-lisp

  (setq browse-url-browser-function 'browse-url-generic
    browse-url-generic-program "firefox")
   ;; browse-url-generic-program "chromium")

   (setq browse-url-browser-function 'w3m-browse-url)
    (autoload 'w3m-browse-url "w3m" "Ask a WWW browser to show a URL." t)
   ;; optional keyboard short-cut
      (global-set-key "\C-xm" 'browse-url-at-point)

#+END_SRC

** dh tools

search dh-|grep elpa
dh-elpa - Debian helper tools for packaging emacs lisp extensions
dh-elpa-helper - helper package for emacs lisp extensions
dh-make-elpa - helper for creating Debian packages from ELPA packages

#+begin_src emacs-lisp :tangle yes

#+end_src

** diminishing modes

#+BEGIN_SRC emacs-lisp

(use-package diminish
  :ensure t
  :init
  (diminish 'which-key-mode)
  (diminish 'linum-relative-mode)
  (diminish 'hungry-delete-mode)
  (diminish 'visual-line-mode)
  (diminish 'subword-mode)
  (diminish 'beacon-mode)
  (diminish 'centered-window-mode)
  (diminish 'irony-mode)
  (diminish 'page-break-lines-mode)
  (diminish 'auto-revert-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'rainbow-mode)
  (diminish 'yas-minor-mode)
  (diminish 'flycheck-mode)
  (diminish 'helm-mode)
  (diminish 'abbrev-mode)
  (diminish 'text-scale-mode)
  (diminish 'eldoc-mode)
  (diminish 'undo-tree-mode)
  (diminish 'auto-fill-mode)
  (diminish 'org-indent-mode)
  (diminish 'company-mode)
  (diminish 'flycheck-mode)
  (diminish 'flyspell-mode))

#+END_SRC

** TODO Dired

   install dired+ with
   el-get-install RET dired+

#+BEGIN_SRC emacs-lisp 

;; (add-to-list 'load-path "~/.emacs.d/local-repo/dired+")
;; (require 'dired+)

(setq dired-dwim-target t)
;; Hide details by default
(add-hook 'dired-mode-hook 'dired-hide-details-mode)
;; Not spawn endless amount of dired buffers
(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file))

#+END_SRC

** dtrt-indent

dtrt-indent guesses the indentation settings of files, and sets the buffer
local variables accordingly. This makes it pleasant to edit corresponding textfiles

#+BEGIN_SRC emacs-lisp

(use-package dtrt-indent
  :straight t
  :diminish t
  :config
  (dtrt-indent-mode +1))

#+END_SRC

** eev 

http://angg.twu.net/
http://angg.twu.net/eev-intros/
this is an app from a Brazilian teacher

#+begin_src emacs-lisp :tangle yes

(use-package eev
 :ensure t)

#+end_src

** elisp

use lisp-interaction-mode for learning lisp 

#+BEGIN_SRC emacs-lisp

;;    (use-package elisp
;;      :hook
;;      (after-save . check-parens)
;;      )

    (use-package highlight-defined
      :straight t
      :custom
      (highlight-defined-face-use-itself t)
      :hook
      (emacs-lisp-mode . highlight-defined-mode))

    (use-package highlight-quoted
      :straight t
      :hook
      (emacs-lisp-mode . highlight-quoted-mode))

    (use-package eros
      :straight t
      :hook
      (emacs-lisp-mode . eros-mode))

    (use-package suggest
      :straight t
      :defer t)

    (use-package ipretty
      :straight t
      :config
      (ipretty-mode 1))

    (use-package nameless
      :straight t
      :hook
      (emacs-lisp-mode .  nameless-mode)
      :custom
      (nameless-global-aliases '())
      (nameless-private-prefix t))

    ;; bind-key can't bind to keymaps
    (use-package erefactor
      :straight t
      :defer t)

    (use-package flycheck-package
      :straight t
      :defer t
      :after flycheck
      (flycheck-package-setup))

  ;; If emacs does not work because of 
  ;; Dash package complaint, install it with
  ;; apt install dash-el - then install it with
  ;; Alt-x package-reinstall RET dash RET and remove 
  ;; it again with "apt purge dash-el" 

 (use-package dash
   :straight t
   :custom
   (dash-enable-fontlock t))

 (use-package dash-functional
   :straight t
   :custom
   (dash-enable-fontlock t))

#+END_SRC

** TODO emacros

#+BEGIN_SRC emacs-lisp

#+END_SRC 

** emacspeak eloud

if you want to use eloud, call it with:
M-x eloud-mode RET    

 you have to setup eloud-speech-rate and eloud-voice in
 "~/.emacs.d/straight/repos/eloud/eloud.el"
 file and compile that - eloud-speech-rate was setup to 269

  #+BEGIN_SRC emacs-lisp
   
    (use-package eloud
     :ensure t
     :load-path "~/.emacs.d/straight/repos/eloud"
     :config
          (setq eloud-espeak-path "/usr/bin/espeak"))

    (require 'eloud)

;; (add-to-list 'load-path "~/.emacs.d/straight/repos/eloud/")
;; (eloud-espeak-path "/usr/bin/espeak")
;; (setq eloud-espeak-path "/usr/bin/espeak-ng -ven-gb -s 160")
;; (setq eloud-espeak-path "/usr/bin/espeak -vpt -s 150")

;; if you want to set espeak voice default pitch, you have to
;; edit the file "/usr/lib/x86_64-linux-gnu/espeak-data/voices/en"

  #+END_SRC

** emacs-reveal

#+BEGIN_SRC emacs-lisp

   (add-to-list 'load-path "/home/vagner/.emacs.d/elpa/emacs-reveal")

;; (setq oer-reveal-plugins nil)
;; (setq oer-reveal-plugins t)

#+END_SRC

** emacs server

#+BEGIN_SRC emacs-lisp

(load "server")
 (unless (server-running-p)
 (server-start))

#+END_SRC

** emacs-w3m

 #+BEGIN_SRC emacs-lisp

         (setq w3m-display-inline-images t) 
	(setq w3m-fill-column 80) ;; if this does not work, modify the file w3m.el itself
	(setq w3m-default-display-inline-images t) 
	(setq w3m-default-save-directory "~/Downloads")

 #+END_SRC

