emacs/.emacs.d/init.org
** emacs-wget 

#+BEGIN_SRC emacs-lisp

;; (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/emacs-wget")

;; (require 'w3m-wget)
;;   (load "w3m-wget")
;;  (autoload 'wget "wget" "wget interface for Emacs." t)
;;  (autoload 'wget-web-page "wget" "wget interface to download whole web page." t)
;;  (autoload 'w3-wget "w3-wget" "wget interface for Emacs/W3." t)
;;  (setq wget-basic-options (cons "-equiet=off" wget-basic-options))
;;  (setq wget-basic-options (cons "-P." wget-basic-options))
;;  (setq wget-process-buffer nil)
;;  (setq wget-command "/usr/bin/wget")

#+END_SRC

** emamux

 #+BEGIN_SRC emacs-lisp

 (use-package emamux
   :straight t
   :defer t)

#+END_SRC

** emmet-mode

#+BEGIN_SRC emacs-lisp

(use-package emmet-mode 
:straight t)

#+END_SRC

** emms-get-lyrics 

#+BEGIN_SRC emacs-lisp

(use-package emms
 :straight t)

(add-to-list 'load-path "~/.emacs.d/local-repo/emms-get-lyrics/")
(require 'emms-get-lyrics)

#+END_SRC

** emms-player 

#+BEGIN_SRC emacs-lisp

(use-package emms-player-simple-mpv
   :straight t
   :after emms
   :config

  ;; Subpackages
;;  (use-package emms-player-simple-mpv-e.g.time-display)
;;  (use-package emms-player-simple-mpv-e.g.playlist-fname)
;;  (use-package emms-player-simple-mpv-e.g.hydra)
;;  (use-package emms-player-simple-mpv)
;;  (use-package emms-player-simple-mpv-control-functions)

  (define-emms-simple-player-mpv my-mpv '(file url streamlist playlist)
    (concat "\\`\\(http[s]?\\|mms\\)://\\|"
	     (apply #'emms-player-simple-regexp
		    "aac" "pls" "m3u"
		    emms-player-base-format-list))
    "mpv" "--no-terminal" "--force-window=no" "--audio-display=no")

  (emms-player-simple-mpv-add-to-converters
   'emms-player-my-mpv "." '(playlist)
   (lambda (track-name) (format "--playlist=%s" track-name)))

  (add-to-list 'emms-player-list 'emms-player-my-mpv))

  (use-package emms-mark-ext :straight t)

#+END_SRC

** engine-mode

#+BEGIN_SRC emacs-lisp

(use-package engine-mode
  :straight t
  :config (engine-mode t))

  (defengine amazon
    "http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=%s")

  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&q=%s")

  (defengine google
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s"
    :keybinding "g")

  (defengine google-images
    "http://www.google.com/images?hl=en&source=hp&biw=1440&bih=795&gbv=2&aq=f&aqi=&aql=&oq=&q=%s")

  (defengine google-maps
    "http://maps.google.com/maps?q=%s"
    :docstring "Mappin' it up.")

  (defengine project-gutenberg
    "http://www.gutenberg.org/ebooks/search/?query=%s")

  (defengine rfcs
    "http://pretty-rfc.herokuapp.com/search?q=%s")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s")

  (defengine twitter
    "https://twitter.com/search?q=%s")

  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w"
    :docstring "Searchin' the wikis.")

  (defengine wiktionary
    "https://www.wikipedia.org/search-redirect.php?family=wiktionary&language=en&go=Go&search=%s")

  (defengine wolfram-alpha
    "http://www.wolframalpha.com/input/?i=%s")

  (defengine youtube
    "http://www.youtube.com/results?aq=f&oq=&search_query=%s")

#+END_SRC

** epg-gpg2

#+BEGIN_SRC emacs-lisp

(setq epg-gpg-program "usr/bin/gpg2")
(setq epa-file t)
(epa-file-enable)
(setq epa-file-select-keys nil)
(setq epa-pinentry-mode 'loopback)
(setq pinentry-start t)

#+END_SRC

** epresent

https://geeksocket.in/posts/presentations-org-emacs/

#+BEGIN_SRC emacs-lisp

(use-package epresent
 :straight t)

#+END_SRC

** erc

#+BEGIN_SRC emacs-lisp

(require 'erc)

(defun irc-maybe ()
     "Connect to IRC."
    (interactive)
    (when (y-or-n-p "IRC? ")
      (erc :server "irc.freenode.net" :port 6667
	   :nick "" :full-name "")
      (erc :server "irc.dalnet.net" :port 6667
	   :nick "" :full-name "")
      (erc :server "irc.oftc.net" :port 6667 :nick "")))

(use-package erc-hl-nicks
  :ensure t
  :config
    (erc-update-modules))

(use-package elcord
  :ensure t)

#+END_SRC

** eshell

https://www.masteringemacs.org/article/complete-guide-mastering-eshell#plan-9-smart-shell

#+BEGIN_SRC emacs-lisp

(add-to-list 'load-path "~/.emacs.d/local-repo/init-eshell")

(require 'eshell)
(require 'em-smart)
(add-hook 'eshell-mode-hook 'eshell-smart-initialize)
(require 'esh-module) ; require modules
(add-to-list 'eshell-modules-list 'eshell-tramp)

#+END_SRC

** evil  

Also look at the built in viper-mode
ant its levels of vim-like

#+BEGIN_SRC emacs-lisp

  (straight-use-package 'evil)
 ;; (evil-mode 1)

#+END_SRC

** evil-collection

#+BEGIN_SRC emacs-lisp

  (straight-use-package 'evil-collection)
 ;; (evil-collection-init t)

#+END_SRC

** evil-macro keys

#+BEGIN_SRC emacs-lisp

  ;; (evil-define-key 'normal 'global
  ;;   ;; select the previously pasted text
  ;;   "gp" "`[v`]"
  ;;   ;; run the macro in the q register
  ;;   "Q" "@q")

  ;; (evil-define-key 'visual 'global
  ;;   ;; run macro in the q register on all selected lines
  ;;   "Q" (kbd ":norm @q RET")
  ;;   ;; repeat on all selected lines
  ;;   "." (kbd ":norm . RET"))

  ;; ;; alternative command version
  ;; (defun my-norm@q ()
  ;;   "Apply macro in q register on selected lines."
  ;;   (interactive)
  ;;   (evil-ex-normal (region-beginning) (region-end) "@q"))

  ;;   (evil-define-key 'visual 'global "Q" #'my-norm@q)

#+END_SRC

** evil-org

#+BEGIN_SRC emacs-lisp

  (straight-use-package 'evil-org)
  
#+END_SRC

*** evil-leader 

#+BEGIN_SRC emacs-lisp

 (global-evil-leader-mode)
 (evil-leader/set-key
   "e" 'find-file
   "b" 'switch-to-buffer
   "k" 'kill-buffer)

  ;; Configure leader key

  (evil-leader/set-key-for-mode 'org-mode
	 "." 'hydra-org-state/body
	 "t" 'org-todo
	 "T" 'org-show-todo-tree
	 "v" 'org-mark-element
	 "a" 'org-agenda
	 "c" 'org-archive-subtree
	 "l" 'evil-org-open-links
	 "C" 'org-resolve-clocks)

#+END_SRC

** eyebrowse
  
#+BEGIN_SRC emacs-lisp

(use-package eyebrowse
  :straight t
  :config
  (progn
    (define-key eyebrowse-mode-map (kbd "M-1") 'eyebrowse-switch-to-window-config-1)
    (define-key eyebrowse-mode-map (kbd "M-2") 'eyebrowse-switch-to-window-config-2)
    (define-key eyebrowse-mode-map (kbd "M-3") 'eyebrowse-switch-to-window-config-3)
    (define-key eyebrowse-mode-map (kbd "M-4") 'eyebrowse-switch-to-window-config-4)
    (define-key eyebrowse-mode-map (kbd "M-5") 'eyebrowse-switch-to-window-config-5)

    (eyebrowse-mode t)
    (setq eyebrowse-new-workspace t)))

#+END_SRC

** eww

Renaming buffers in eww - so that it has tabs
eww does not have tabs, but new buffers behave like tabs on it

#+begin_src emacs-lisp

(when (fboundp 'eww)
  (defun cyber-rename-eww-buffer ()
    "Rename `eww-mode' buffer so sites open in new page.
URL `http://ergoemacs.org/emacs/emacs_eww_web_browser.html'
Version 2017-11-10"
    (let (($title (plist-get eww-data :title)))
      (when (eq major-mode 'eww-mode )
        (if $title
            (rename-buffer (concat "eww " $title ) t)
          (rename-buffer "eww" t)))))

  (add-hook 'eww-after-render-hook 'cyber-rename-eww-buffer))

#+end_src

