emacs/.emacs.d/init.el

(global-set-key [f6] 'spell-checker)
                               (global-set-key [f7] 'ispell-buffer)

                               (require 'ispell)
                               (require 'flyspell)

                               (defun spell-checker ()
                                 "spell checker (on/off) with selectable dictionary"
                                 (interactive)
                                 (if flyspell-mode
                                     (flyspell-mode-off)
                                   (progn
                                     (flyspell-mode)
                                     (ispell-change-dictionary
                                      (completing-read
                                       "Use new dictionary (RET for *default*): "
                                       (and (fboundp 'ispell-valid-dictionary-list)
                                        (mapcar 'list (ispell-valid-dictionary-list)))
                                       nil t))
                                     )))

                               (defun my-turn-spell-checking-on ()
                                 "Turn flyspell-mode on."
                                 (flyspell-mode 1))
                               (add-hook 'text-mode-hook 'my-turn-spell-checking-on)

                               ;; enable flyspell in text mode (and derived modes)
                               ;; (add-hook 'text-mode-hook 'flyspell-mode)

                             ;; elisp-index-search
                             ;; Kevin Rodgers 〔kevin.d.rodg…@gmail.com〕, 2008-10-09
                             (defadvice elisp-index-search (before interactive-default activate)
                               "Provide the symbol at point as the default when reading TOPIC interactively."
                               (interactive
                                (let ((symbol-at-point (thing-at-point 'symbol)))
                                  (list (read-string (if symbol-at-point
                                                         (format "Topic (%s): " symbol-at-point)
                                                       (format "Topic: "))
                                                     nil nil symbol-at-point)))))

                             ;; fix for describe-major-mode
                             (defun describe-major-mode ()
                               "Show doc string for current major-mode."
                               ;; code by Kevin Rodgers. 2009-02-25
                               (interactive)
                               (describe-function major-mode))

                             (global-set-key (kbd "C-h m") 'describe-major-mode)

                         (add-to-list 'load-path "~/.emacs.d/local-repo/pp-c-l")
                           (require 'pp-c-l)
                           (pretty-control-l-mode 1)


                       ;; cyber-toggle-letter-case
                       (defun cyber-toggle-letter-case ()
                         "Toggle the letter case of current word or text selection.
                       Always cycle in this order: Init Caps, ALL CAPS, all lower.

                       URL `http://ergoemacs.org/emacs/modernization_upcase-word.html'
                       Version 2017-04-19"
                         (interactive)
                         (let (
                               (deactivate-mark nil)
                               $p1 $p2)
                           (if (use-region-p)
                               (setq $p1 (region-beginning)
                                     $p2 (region-end))
                             (save-excursion
                               (skip-chars-backward "[:alnum:]-_")
                               (setq $p1 (point))
                               (skip-chars-forward "[:alnum:]-_")
                               (setq $p2 (point))))
                           (when (not (eq last-command this-command))
                             (put this-command 'state 0))
                           (cond
                            ((equal 0 (get this-command 'state))
                             (upcase-initials-region $p1 $p2)
                             (put this-command 'state 1))
                            ((equal 1  (get this-command 'state))
                             (upcase-region $p1 $p2)
                             (put this-command 'state 2))
                            ((equal 2 (get this-command 'state))
                             (downcase-region $p1 $p2)
                             (put this-command 'state 0)))))

                   (global-set-key (kbd "C-0") 'cyber-toggle-letter-case)

                     ;; cyber-toggle-previous-letter-case
                     (defun cyber-toggle-previous-letter-case ()
                       "Toggle the letter case of the letter to the left of cursor.
                     URL `http://ergoemacs.org/emacs/modernization_upcase-word.html'
                     Version 2015-12-22"
                       (interactive)
                       (let ((case-fold-search nil))
                         (left-char 1)
                         (cond
                          ((looking-at "[[:lower:]]") (upcase-region (point) (1+ (point))))
                          ((looking-at "[[:upper:]]") (downcase-region (point) (1+ (point)))))
                         (right-char)))

                   (global-set-key (kbd "C-s-0") 'cyber-toggle-previous-letter-case)

                 ;; cyber-select-line
                 (defun cyber-select-line ()
                   "Select current line. If region is active, extend selection downward by line.
                 URL `http://ergoemacs.org/emacs/modernization_mark-word.html'
                 Version 2017-11-01"
                   (interactive)
                   (if (region-active-p)
                       (progn
                         (forward-line 1)
                         (end-of-line))
                     (progn
                       (end-of-line)
                       (set-mark (line-beginning-position)))))

                 (global-set-key (kbd "M-L") 'cyber-select-line)

               ;; cyber-select-text-in-quote
               (defun cyber-select-text-in-quote ()
                 "Select text between the nearest left and right delimiters.
               Delimiters here includes the following chars: \"<>(){}[]“”‘’‹›«»「」『』【】〖〗《》〈〉〔〕（）
               This command select between any bracket chars, not the inner text of a bracket. For example, if text is

                (a(b)c▮)

                the selected char is “c”, not “a(b)c”.

               URL `http://ergoemacs.org/emacs/modernization_mark-word.html'
               Version 2016-12-18"
                 (interactive)
                 (let (
                       ($skipChars
                        (if (boundp 'cyber-brackets)
                            (concat "^\"" cyber-brackets)
                          "^\"<>(){}[]“”‘’‹›«»「」『』【】〖〗《》〈〉〔〕（）"))
                       $pos
                       )
                   (skip-chars-backward $skipChars)
                   (setq $pos (point))
                   (skip-chars-forward $skipChars)
                   (set-mark $pos)))

                   (global-set-key (kbd "M-Q") 'cyber-select-text-in-quote)

             ;; cyber-select-block
             (defun cyber-select-block ()
             "Select the current/next block of text between blank lines.
           If region is active, extend selection downward by block.

           URL `http://ergoemacs.org/emacs/modernization_mark-word.html'
           Version 2017-11-01"
             (interactive)
             (if (region-active-p)
                 (re-search-forward "\n[ \t]*\n" nil "move")
               (progn
                 (skip-chars-forward " \n\t")
                 (when (re-search-backward "\n[ \t]*\n" nil "move")
                   (re-search-forward "\n[ \t]*\n"))
                 (push-mark (point) t t)
                 (re-search-forward "\n[ \t]*\n" nil "move"))))

                  (global-set-key (kbd "M-B") 'cyber-select-block)

        ;; cyber-extend-selection
        (defun xah-extend-selection ()
         (interactive)
          (if (region-active-p)
              (progn
                (let (($rb (region-beginning)) ($re (region-end)))
                  (goto-char $rb)
                  (cond
                   ((looking-at "\\s(")
                    (if (eq (nth 0 (syntax-ppss)) 0)
                        (progn
                          (message "left bracket, depth 0.")
                          (end-of-line) ; select current line
                          (set-mark (line-beginning-position)))
                      (progn
                        (message "left bracket, depth not 0")
                        (up-list -1 t t)
                        (mark-sexp))))
                   ((eq $rb (line-beginning-position))
                    (progn
                      (goto-char $rb)
                      (let (($firstLineEndPos (line-end-position)))
                        (cond
                         ((eq $re $firstLineEndPos)
                          (progn
                            (message "exactly 1 line. extend to next whole line." )
                            (forward-line 1)
                            (end-of-line)))
                         ((< $re $firstLineEndPos)
                          (progn
                            (message "less than 1 line. complete the line." )
                            (end-of-line)))
                         ((> $re $firstLineEndPos)
                          (progn
                            (message "beginning of line, but end is greater than 1st end of line" )
                            (goto-char $re)
                            (if (eq (point) (line-end-position))
                                (progn
                                  (message "exactly multiple lines" )
                                  (forward-line 1)
                                  (end-of-line))
                              (progn
                                (message "multiple lines but end is not eol. make it so" )
                                (goto-char $re)
                                (end-of-line)))))
                         (t (error "logic error 42946" ))))))
                   ((and (> (point) (line-beginning-position)) (<= (point) (line-end-position)))
                    (progn
                      (message "less than 1 line" )
                      (end-of-line) ; select current line
                      (set-mark (line-beginning-position))))
                   (t (message "last resort" ) nil))))
            (progn
              (cond
               ((looking-at "\\s(")
                (message "left bracket")
                (mark-sexp)) ; left bracket
               ((looking-at "\\s)")
                (message "right bracket")
                (backward-up-list) (mark-sexp))
               ((looking-at "\\s\"")
                (message "string quote")
                (mark-sexp)) ; string quote
               ((and (eq (point) (line-beginning-position)) (not (looking-at "\n")))
                (message "beginning of line and not empty")
                (end-of-line)
                (set-mark (line-beginning-position)))
               ((or (looking-back "\\s_" 1) (looking-back "\\sw" 1))
                (message "left is word or symbol")
                (skip-syntax-backward "_w" )
                ;; (re-search-backward "^\\(\\sw\\|\\s_\\)" nil t)
                (mark-sexp))
               ((and (looking-at "\\s ") (looking-back "\\s " 1))
                (message "left and right both space" )
                (skip-chars-backward "\\s " ) (set-mark (point))
                (skip-chars-forward "\\s "))
               ((and (looking-at "\n") (looking-back "\n" 1))
                (message "left and right both newline")
                (skip-chars-forward "\n")
                (set-mark (point))
                (re-search-forward "\n[ \t]*\n")) ; between blank lines, select next text block
               (t (message "just mark sexp" )
                  (mark-sexp))
               ;;
               ))))

             (global-set-key (kbd "M-E") 'cyber-extend-selection)

        ;; cyber-brackets 
        (defvar cyber-brackets nil "string of left/right brackets pairs.")
        (setq cyber-brackets "()[]{}<>（）［］｛｝⦅⦆〚〛⦃⦄“”‘’‹›«»「」〈〉《》【】〔〕⦗⦘『』〖〗〘〙｢｣⟦⟧⟨⟩⟪⟫⟮⟯⟬⟭⌈⌉⌊⌋⦇⦈⦉⦊❛❜❝❞❨❩❪❫❴❵❬❭❮❯❰❱❲❳〈〉⦑⦒⧼⧽﹙﹚﹛﹜﹝﹞⁽⁾₍₎⦋⦌⦍⦎⦏⦐⁅⁆⸢⸣⸤⸥⟅⟆⦓⦔⦕⦖⸦⸧⸨⸩｟｠⧘⧙⧚⧛⸜⸝⸌⸍⸂⸃⸄⸅⸉⸊᚛᚜༺༻༼༽⏜⏝⎴⎵⏞⏟⏠⏡﹁﹂﹃﹄︹︺︻︼︗︘︿﹀︽︾﹇﹈︷︸")

         ;; cyber-left-brackets
        (defvar cyber-left-brackets '("(" "{" "[" "<" "〔" "【" "〖" "〈" "《" "「" "『" "“" "‘" "‹" "«" )
          "List of left bracket chars.")
        (progn
        ;; make cyber-left-brackets based on cyber-brackets
          (setq cyber-left-brackets '())
          (dotimes ($x (- (length cyber-brackets) 1))
            (when (= (% $x 2) 0)
              (push (char-to-string (elt cyber-brackets $x))
                    cyber-left-brackets)))
          (setq cyber-left-brackets (reverse cyber-left-brackets)))

      (defvar cyber-right-brackets '(")" "]" "}" ">" "〕" "】" "〗" "〉" "》" "」" "』" "”" "’" "›" "»")
        "list of right bracket chars.")
      (progn
        (setq cyber-right-brackets '())
        (dotimes ($x (- (length cyber-brackets) 1))
          (when (= (% $x 2) 1)
            (push (char-to-string (elt cyber-brackets $x))
                  cyber-right-brackets)))
        (setq cyber-right-brackets (reverse cyber-right-brackets)))

     ;; cyber-backward-left-bracket
    (defun cyber-backward-left-bracket ()
      "Move cursor to the previous occurrence of left bracket.
    The list of brackets to jump to is defined by `cyber-left-brackets'.
    URL `http://ergoemacs.org/emacs/emacs_navigating_keys_for_brackets.html'
    Version 2015-10-01"
      (interactive)
      (re-search-backward (regexp-opt cyber-left-brackets) nil t))

    ;; cyber-forward-right-bracket
    (defun cyber-forward-right-bracket ()
      "Move cursor to the next occurrence of right bracket.
    The list of brackets to jump to is defined by `cyber-right-brackets'.
    URL `http://ergoemacs.org/emacs/emacs_navigating_keys_for_brackets.html'
    Version 2015-10-01"
      (interactive)
      (re-search-forward (regexp-opt cyber-right-brackets) nil t))



  ;; cyber-goto-matching-bracket
  (defun cyber-goto-matching-bracket ()
    "Move cursor to the matching bracket.
  If cursor is not on a bracket, call `backward-up-list'.
  The list of brackets to jump to is defined by `cyber-left-brackets' and `cyber-right-brackets'.
  URL `http://ergoemacs.org/emacs/emacs_navigating_keys_for_brackets.html'
  Version 2016-11-22"
    (interactive)
    (if (nth 3 (syntax-ppss))
        (backward-up-list 1 'ESCAPE-STRINGS 'NO-SYNTAX-CROSSING)
      (cond
       ((eq (char-after) ?\") (forward-sexp))
       ((eq (char-before) ?\") (backward-sexp ))
       ((looking-at (regexp-opt cyber-left-brackets))
        (forward-sexp))
       ((looking-back (regexp-opt cyber-right-brackets) (max (- (point) 1) 1))
        (backward-sexp))
       (t (backward-up-list 1 'ESCAPE-STRINGS 'NO-SYNTAX-CROSSING)))))

    ;; cyber-forward-quote-smart
    (defun cyber-forward-quote-smart ()
    "Move cursor to the current or next string quote.
  Place cursor at the position after the left quote.
  Repeated call will find the next string.
  URL `http://ergoemacs.org/emacs/emacs_navigating_keys_for_brackets.html'
  Version 2016-11-22"
    (interactive)
    (let (($pos (point)))
      (if (nth 3 (syntax-ppss))
          (progn
            (backward-up-list 1 'ESCAPE-STRINGS 'NO-SYNTAX-CROSSING)
            (forward-sexp)
            (re-search-forward "\\\"" nil t))
        (progn (re-search-forward "\\\"" nil t)))
      (when (<= (point) $pos)
        (progn (re-search-forward "\\\"" nil t)))))

  ;; cyber-backward-quote 
  (defun cyber-backward-quote ()
    "Move cursor to the previous occurrence of \".
  If there are consecutive quotes of the same char, keep moving until none.
  Returns `t' if found, else `nil'.
  URL `http://ergoemacs.org/emacs/emacs_navigating_keys_for_brackets.html'
  Version 2016-07-23"
    (interactive)
    (if (re-search-backward "\\\"+" nil t)
        (when (char-before) ; isn't nil, at beginning of buffer
          (while (char-equal (char-before) (char-after))
            (left-char)
            t))
      (progn
        (message "No more quotes before cursor.")
        nil))) 

 ;; cyber-change-bracket-pairs
(defun cyber-change-bracket-pairs ( @from-chars @to-chars)
  "Change bracket pairs from one type to another.

For example, change all parenthesis () to square brackets [].

Works on selected text, or current text block.

When called in lisp program, @from-chars or @to-chars is a string of bracket pair. eg \"(paren)\",  \"[bracket]\", etc.
The first and last characters are used.
If the string contains “,2”, then the first 2 chars and last 2 chars are used, for example  \"[[bracket,2]]\".
If @to-chars is equal to string “none”, the brackets are deleted.

 If the string has length greater than 2, the rest are ignored.

URL `http://ergoemacs.org/emacs/elisp_change_brackets.html'
Version 2018-03-31"
  (interactive
   (let (($bracketsList
          '("(paren)"
            "{brace}"
            "[square]"
            "<greater>"
            "`emacs'"
            "`markdown`"
            "~tilde~"
            "=equal="
            "\"ascii quote\""
            "[[double square,2]]"
            "“curly quote”"
            "‘single quote’"
            "‹angle quote›"
            "«double angle quote»"
            "「corner」"
            "『white corner』"
            "【LENTICULAR】"
            "〖white LENTICULAR〗"
            "〈angle bracket〉"
            "《double angle bracket》"
            "〔TORTOISE〕"
            "⦅white paren⦆"
            "〚white square〛"
            "⦃white curly bracket⦄"
            "〈angle bracket〉"
            "⦑ANGLE BRACKET WITH DOT⦒"
            "⧼CURVED ANGLE BRACKET⧽"
            "⟦math square⟧"
            "⟨math angle⟩"
            "⟪math DOUBLE ANGLE BRACKET⟫"
            "⟮math FLATTENED PARENTHESIS⟯"
            "⟬math WHITE TORTOISE SHELL BRACKET⟭"
            "❛HEAVY SINGLE QUOTATION MARK ORNAMENT❜"
            "❝HEAVY DOUBLE TURNED COMMA QUOTATION MARK ORNAMENT❞"
            "❨MEDIUM LEFT PARENTHESIS ORNAMENT❩"
            "❪MEDIUM FLATTENED LEFT PARENTHESIS ORNAMENT❫"
            "❴MEDIUM LEFT CURLY BRACKET ORNAMENT❵"
            "❬MEDIUM LEFT-POINTING ANGLE BRACKET ORNAMENT❭"
            "❮HEAVY LEFT-POINTING ANGLE QUOTATION MARK ORNAMENT❯"
            "❰HEAVY LEFT-POINTING ANGLE BRACKET ORNAMENT❱"
            "none"
            )))
     (list
      (ido-completing-read "Replace this:" $bracketsList )
      (ido-completing-read "To:" $bracketsList ))))
  (let ( $p1 $p2 )
    (if (use-region-p)
        (progn
          (setq $p1 (region-beginning))
          (setq $p2 (region-end)))
      (save-excursion
        (if (re-search-backward "\n[ \t]*\n" nil "move")
            (progn (re-search-forward "\n[ \t]*\n")
                   (setq $p1 (point)))
          (setq $p1 (point)))
        (if (re-search-forward "\n[ \t]*\n" nil "move")
            (progn (re-search-backward "\n[ \t]*\n")
                   (setq $p2 (point)))
          (setq $p2 (point)))))
    (save-excursion
      (save-restriction
        (narrow-to-region $p1 $p2)
        (let ( (case-fold-search nil)
               $fromLeft
               $fromRight
               $toLeft
               $toRight)
          (cond
           ((string-match ",2" @from-chars  )
            (progn
              (setq $fromLeft (substring @from-chars 0 2))
              (setq $fromRight (substring @from-chars -2))))
           (t
            (progn
              (setq $fromLeft (substring @from-chars 0 1))
              (setq $fromRight (substring @from-chars -1)))))
          (cond
           ((string-match ",2" @to-chars)
            (progn
              (setq $toLeft (substring @to-chars 0 2))
              (setq $toRight (substring @to-chars -2))))
           ((string-match "none" @to-chars)
            (progn
              (setq $toLeft "")
              (setq $toRight "")))
           (t
            (progn
              (setq $toLeft (substring @to-chars 0 1))
              (setq $toRight (substring @to-chars -1)))))
          (cond
           ((string-match "markdown" @from-chars)
            (progn
              (goto-char (point-min))
              (while
                  (re-search-forward "`\\([^`]+?\\)`" nil t)
                (overlay-put (make-overlay (match-beginning 0) (match-end 0)) 'face 'highlight)
                (replace-match (concat $toLeft "\\1" $toRight ) "FIXEDCASE" ))))
           ((string-match "tilde" @from-chars)
            (progn
              (goto-char (point-min))
              (while
                  (re-search-forward "~\\([^~]+?\\)~" nil t)
                (overlay-put (make-overlay (match-beginning 0) (match-end 0)) 'face 'highlight)
                (replace-match (concat $toLeft "\\1" $toRight ) "FIXEDCASE" ))))
           ((string-match "ascii quote" @from-chars)
            (progn
              (goto-char (point-min))
              (while
                  (re-search-forward "\"\\([^\"]+?\\)\"" nil t)
                (overlay-put (make-overlay (match-beginning 0) (match-end 0)) 'face 'highlight)
                (replace-match (concat $toLeft "\\1" $toRight ) "FIXEDCASE" ))))
           ((string-match "equal" @from-chars)
            (progn
              (goto-char (point-min))
              (while
                  (re-search-forward "=\\([^=]+?\\)=" nil t)
                (overlay-put (make-overlay (match-beginning 0) (match-end 0)) 'face 'highlight)
                (replace-match (concat $toLeft "\\1" $toRight ) "FIXEDCASE" ))))
           (t (progn
                (progn
                  (goto-char (point-min))
                  (while (search-forward $fromLeft nil t)
                    (overlay-put (make-overlay (match-beginning 0) (match-end 0)) 'face 'highlight)
                    (replace-match $toLeft "FIXEDCASE" "LITERAL")))
                (progn
                  (goto-char (point-min))
                  (while (search-forward $fromRight nil t)
                    (overlay-put (make-overlay (match-beginning 0) (match-end 0)) 'face 'highlight)
                    (replace-match $toRight "FIXEDCASE" "LITERAL")))))))))))

(defun my-turn-spell-checking-on ()
  "Turn flyspell-mode on."
  (flyspell-mode 1))

(add-hook 'text-mode-hook 'my-turn-spell-checking-on)

 ;; enable flyspell in text mode (and derived modes)
 ;; (add-hook 'text-mode-hook 'flyspell-mode)
