emacs/.emacs.d/init.org
** flyspell

#+BEGIN_SRC emacs-lisp

(defun my-turn-spell-checking-on ()
  "Turn flyspell-mode on."
  (flyspell-mode 1))

(add-hook 'text-mode-hook 'my-turn-spell-checking-on)

 ;; enable flyspell in text mode (and derived modes)
 ;; (add-hook 'text-mode-hook 'flyspell-mode)

#+END_SRC

** free-keys

Show unbound keys available for bounding 

#+BEGIN_SRC emacs-lisp

(straight-use-package 'free-keys)

#+END_SRC

** genealogy 

#+BEGIN_SRC emacs-lisp

(add-to-list 'load-path "~/.emacs.d/local-repo/gedcom")

(autoload 'gedcom-mode "gedcom")
(setq auto-mode-alist (cons '("\\.ged$" . gedcom-mode) auto-mode-alist))

#+END_SRC

** TODO ggtags
   
https://github.com/leoliu/ggtags

you have to issue the command etags in the working directories

#+BEGIN_SRC emacs-lisp

(use-package ggtags
:straight t
:config 
 (add-hook 'c-mode-common-hook
      (lambda ()
	(when (derived-mode-p 'c-mode 'c++-mode 'java-mode 'php-mode 'web-mode)
	  (ggtags-mode 1)))))

#+END_SRC

** gitlab 

#+BEGIN_SRC emacs-lisp

(use-package gitlab
 :straight t)
   (setq gitlab-host "https://gitlab.com"
	 gitlab-token-id "")

#+END_SRC

** gnutls-fix-bug

#+BEGIN_SRC emacs-lisp

;;   (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3/")
;;     (setq gnutls-verify-error t)
;;     (setq tls-checktrust t)

;;     (toggle-debug-on-error)

#+END_SRC

** grasp 

#+BEGIN_SRC emacs-lisp

#+END_SRC

** gtklp printer app

#+BEGIN_SRC emacs-lisp

(setq lpr-command "gtklp")
(setq ps-lpr-command "gtklp")

#+END_SRC

** TODO helm

https://github.com/daedreth/UncleDavesEmacs/blob/master/config.org#helm

#+BEGIN_SRC emacs-lisp

  ;;  (use-package helm
  ;;    :straight t)

    ;; helm

       (use-package helm)
          (helm-mode 1)

       (define-key helm-map (kbd "s-j") 'helm-next-line)
       (define-key helm-map (kbd "s-k") 'helm-previous-line)

    ;; helm-swoop


  (use-package helm-swoop)

       (global-set-key (kbd "M-x") 'helm-M-x)
       (setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x
       (global-set-key (kbd "C-x C-f") 'helm-find-files)

#+END_SRC

** helm-deft

#+begin_src emacs-lisp 

(straight-use-package '(helm-deft :type git
                                  :host github
                                  :repo "dfeich/helm-deft"))

(require 'helm-deft)
(setq helm-deft-extension "org")
(setq helm-deft-dir-list '(
                           "~/org~/"
                           "~/Documents/"
                           ))

#+end_src

** helm-mu 

#+BEGIN_SRC emacs-lisp

(use-package helm-mu
  :straight t)

#+END_SRC

** hippie-expand

#+BEGIN_SRC emacs-lisp

(fset 'my-complete-file-name
   (make-hippie-expand-function '(try-complete-file-name-partially
					try-complete-file-name)))
   (global-set-key "\M-/" 'my-complete-file-name)
   (global-set-key "\M-\\" 'comint-dynamic-complete-filename)

#+END_SRC

** hydra  
  
#+BEGIN_SRC emacs-lisp

    (straight-use-package 'hydra)

#+END_SRC

** hyperbole

#+BEGIN_SRC emacs-lisp

  ;; (unless (package-installed-p 'hyperbole)
  ;;   (package-refresh-contents)	
  ;;   (package-install 'hyperbole))
  ;; (require 'hyperbole)

#+END_SRC

** icicles

#+BEGIN_SRC emacs-lisp

  ;; (require 'icicles)
  ;; (icy-mode 1) 

#+END_SRC

** image-magick 

#+BEGIN_SRC emacs-lisp

(use-package eimp
 :ensure t)

(autoload 'eimp-mode "eimp" "Emacs Image Manipulation Package." t)
      (add-hook 'image-mode-hook 'eimp-mode)

(defun do-org-show-all-inline-images ()
  (interactive)
  (org-display-inline-images t t))
(global-set-key (kbd "C-c C-x C v")
		'do-org-show-all-inline-images)

  ;; apt install aview
  (defun asciiview (imagefile)
    ;; use asciiview (part of aatools) to render image file as text to buffer
    (interactive "fChoose image file: ")
    (save-excursion
      (with-current-buffer (pop-to-buffer (format "*asciiview %s*" imagefile))
	(insert
	 (car (last (butlast
		 (split-string
		  (shell-command-to-string
		   (format
		    "echo q | asciiview -driver stdout -kbddriver stdin %s 2>/dev/null"
		    (shell-quote-argument imagefile)))
		  "^L")))))
	(view-mode))))

   (autoload 'thumbs "thumbs" "Preview images in a directory." t)

   ;; then M-x thumbs

#+END_SRC

** imaxima 

#+BEGIN_SRC emacs-lisp

(defvar imaxima-fnt-size "Large")
(defvar imaxima-use-maxima-mode-flag t)

#+END_SRC 

** impatient-mode

#+BEGIN_SRC emacs-lisp

(use-package impatient-mode 
:straight t)

#+END_SRC

** indent lisp

#+BEGIN_SRC emacs-lisp

(setq org-src-tab-acts-natively t)

  (defun my/org-cleanup ()
  (interactive)
  (org-edit-special)
  (indent-buffer)
  (org-edit-src-exit))

  (defun indent-buffer ()
  (interactive)
  (indent-region (point-min) (point-max)))

#+END_SRC

** init.el

#+BEGIN_SRC emacs-lisp

(defun find-user-init-file ()
  "Edit the `user-init-file', in another window."
  (interactive)
  (find-file-other-window user-init-file)
  (rotate-frame-clockwise))

(global-set-key (kbd "C-c I") 'find-user-init-file)

#+END_SRC

** ipp printer

#+BEGIN_SRC emacs-lisp

(add-to-list 'load-path "~/.emacs.d/local-repo/ipp")
(require 'ipp)

#+END_SRC

** jabber

#+BEGIN_SRC emacs-lisp

(use-package jabber 
 :straight t)

#+END_SRC

** key-chords

#+begin_src emacs-lisp

(use-package key-chord
  :ensure t
  :init
  (progn 
    (setq key-chord-two-keys-delay .015
          key-chord-one-key-delay .020)
    (key-chord-mode 1)
    (key-chord-define-global "cg" 'undo)
    (key-chord-define-global "yp" 'other-window)
    (key-chord-define-global ";0" 'delete-window)
    (key-chord-define-global ";1" 'delete-other-windows)
    (key-chord-define-global ";2" 'split-window-below)
    (key-chord-define-global ";3"  'split-window-right)
    (key-chord-define-global ",." 'beginning-of-buffer)
    (key-chord-define-global ".p" 'end-of-buffer)
    (key-chord-define-global "jw" 'avy-goto-word-or-subword-1)
    (key-chord-define-global "jc" 'avy-goto-char)
    (key-chord-define-global "jl" 'avy-goto-line)
    ;; (key-chord-define-global "jb" 'ace-jump-buffer)
    ;; (key-chord-define-global "jo" 'ace-jump-buffer-other-window)
    (key-chord-define-global "'l" 'ido-switch-buffer)
    (key-chord-define-global "'-" 'smex)
    (key-chord-define-global ",r" 'find-file)
    (key-chord-define-global ".c" 'ido-dired)
    (key-chord-define-global "0r" ")")
    (key-chord-define-global "1'" "!")
    (key-chord-define-global "2," "@")
    (key-chord-define-global "3." "#")
    (key-chord-define-global "4p" "$")
    (key-chord-define-global "5y" "%")
    (key-chord-define-global "6y" "^")
    (key-chord-define-global "7f" "&")
    (key-chord-define-global "8g" "*")
    (key-chord-define-global "9c" "(")
    (key-chord-define-global "-l" "_")
    (key-chord-define emacs-lisp-mode-map "7f" "&optional ")))

#+end_src

** linguistic

#+BEGIN_SRC emacs-lisp

(use-package linguistic 
 :straight t)

#+END_SRC

** linum

#+BEGIN_SRC emacs-lisp

(use-package linum-relative
  :ensure t
  :init
  (setq linum-format 'linum-relative)
  :config
  (setq linum-relative-current-symbol ""))

  ;; (straight-use-package 'linum)

  ;; (setq linum-relative-current-symbol "")

  ;; (linum-relative-global-mode)
  ;; (eval-after-load "linum"
  ;;   '(set-face-attribute 'linum nil :height 100))

  ;; (autopair-global-mode)

  ;; (global-undo-tree-mode)

  ;; (defun linum-update-window-scale-fix (win)
  ;;   "fix linum for scaled text"
  ;;   (set-window-margins win
  ;; 		      (ceiling (* (if (boundp 'text-scale-mode-step)
  ;; 				      (expt text-scale-mode-step
  ;; 					    text-scale-mode-amount) 1)
  ;; 				  (if (car (window-margins))
  ;; 				      (car (window-margins)) 1)
  ;; 				  ))))
  ;; (advice-add #'linum-update-window :after #'linum-update-window-scale-fix)

#+END_SRC

** lispy

#+BEGIN_SRC emacs-lisp

(use-package lispy
   :straight t)

  (add-hook 'emacs-lisp-mode-hook (lambda () (lispy-mode 1)))

  (defun conditionally-enable-lispy ()
    (when (eq this-command 'eval-expression)
      (lispy-mode 1)))

  (add-hook 'minibuffer-setup-hook 'conditionally-enable-lispy)

#+END_SRC

** lorem-ipsum

#+BEGIN_SRC emacs-lisp

(use-package lorem-ipsum
    :straight t)

;;(lorem-ipsum-use-default-bindings)

;;  (add-hook 'sgml-mode-hook (lambda ()
;;			    (setq Lorem-ipsum-paragraph-separator "<br><br>\n"
;;				  Lorem-ipsum-sentence-separator "&nbsp class="comment">;&nbsp;"
;;				  Lorem-ipsum-list-beginning "<ul>\n"
;;				  Lorem-ipsum-list-bullet "<li>"
;;				  Lorem-ipsum-list-item-end "</li>\n"
;;				  Lorem-ipsum-list-end "</ul>\n")))

#+END_SRC

** lyrics 

#+BEGIN_SRC emacs-lisp

(use-package lyrics
 :straight t)

#+END_SRC

** magit

#+BEGIN_SRC emacs-lisp

  ;; (use-package magit 
  ;;  :straight t
  ;;  :config
  ;; (global-set-key (kbd "C-c g") 'magit-status))

(use-package magit
  :straight t
  :config
  (setq magit-push-always-verify nil)
  (setq git-commit-summary-max-length 50)
  :bind
  ("M-g" . magit-status))

#+END_SRC

** memacs

#+BEGIN_SRC emacs-lisp

#+END_SRC

