emacs/.emacs.d/init.org
** memrise

#+BEGIN_SRC emacs-lisp

  ;; (use-package memrise
  ;;   :quelpa (memrise
  ;; 	   :fetcher github
  ;; 	   :repo "SavchenkoValeriy/memrise.el"))

  ;; (setq memrise-sync-requests t)

#+END_SRC

** message-mode 

#+BEGIN_SRC emacs-lisp

;; colorizing multiply-quoted lines

(add-hook 'message-mode-hook
          (lambda ()
            (font-lock-add-keywords nil
               '(("^[ \t]*>[ \t]*>[ \t]*>.*$"
                  (0 'message-multiply-quoted-text-face))
                 ("^[ \t]*>[ \t]*>.*$"
                  (0 'message-double-quoted-text-face))))))

 ;; email address
(setq user-mail-address "vagnerrener@gmail.com"
        user-full-name "Vagner Rener")

 ;; add Cc and Bcc headers to the message buffer
  (setq message-default-mail-headers "Cc: \nBcc: \n")

 ;; postponed message is put in the following draft file
  (setq message-auto-save-directory "~/Mail/drafts")

 ;; send the current buffer to a email list address  

(defun message-send-current-buffer (addr)
  (interactive (list (ido-completing-read "To: " known-email-addresses)))
  (let ((orig-buffer (current-buffer)))
    (message-mail addr
                  (if (equal 'eww-mode major-mode)
                      eww-current-url
                    (buffer-name orig-buffer)))
    (message-goto-body)
    (insert (save-excursion (set-buffer orig-buffer)
                            (buffer-substring (point-min) (point-max))))
    (message-send-and-exit)))

 ;; attach the content of a folder to a message

(defun message-attach-all-files-from-folder(&optional disposition dir-to-attach)
     "create the mml code to attach all files found in a given directory"
     (interactive)
  
     (if (eq disposition nil)
         (setq disposition (completing-read "Enter default disposition to use: " '(("attachment" 1) ("inline" 2)) nil t)))
  
     (if (eq dir-to-attach nil)
         (setq dir-to-attach (read-directory-name "Select a folder to attach: ")))
  
     (if (not (string-match "/$" dir-to-attach))
         (setq dir-to-attach (concat dir-to-attach "/")))
  
     (dolist (file (directory-files dir-to-attach))
       (when (and (not (string= "." file)) (not (string= ".." file)))
         (let (full-file-path mime-type)
           (setq full-file-path (concat dir-to-attach file))
           (if (file-readable-p full-file-path)
               (if (file-directory-p full-file-path)
                   (message-attach-all-files-from-folder disposition full-file-path)
  
                 (setq mime-type (substring (shell-command-to-string (concat "file --mime-type --brief " (shell-quote-argument (expand-file-name full-file-path)))) 0 -1))
                 (insert-string (concat "<#part type=\"" mime-type "\" filename=\"" full-file-path "\" disposition=" disposition ">\n")))))))) 

 ;; shortcuts

 ;; C-x m	brings a message buffer
 ;; C-h m	browse the full list
 ;; C-c C-c	send the message and exit the message buffer
 ;; C-c C-a	add an attachment
 ;; C-c C-k	cancel the message
 ;; C-c C-d	postpone the message
 ;; C-c C-s	send the message but don't exit the message buffer
 ;; C-c C-b	go to the start of the message
 ;; C-c C-z	kill text from point until end of buffer

#+END_SRC

** mingus

#+BEGIN_SRC emacs-lisp

(use-package mingus
 :straight t)

#+END_SRC

** more niceties

#+BEGIN_SRC emacs-lisp

;; Mouse scrolling
  (setq mouse-wheel-scroll-amount '(1)
	mouse-wheel-progressive-speed nil 
	scroll-conservatively 101
	hscroll-margin 1
	hscroll-step 1
	scroll-preserve-screen-position t) 

;; gtk-tooltipos
      (setq x-gtk-use-system-tooltips nil
	    use-dialog-box nil)

   ;; Desktop mode
   ;; (desktop-save-mode t)

    ;; Save minibuffer history.
    (savehist-mode 1)

    ;; Each file in a new window.
    ;; (setq pop-up-frames t)

  ;; Disk space is cheap. Save lots. (c) Sacha Chua
  ;; Backups

  (setq backup-directory-alist '(("." . "~/.emacs.d/backups"))
	delete-old-versions -1
	version-control t
	vc-make-backup-files t
	auto-save-list-file-prefix "~/.emacs.d/autosave/"
	auto-save-file-name-transforms '((".*" "~/.emacs.d/autosave/" t))
	undo-tree-auto-save-history t
	undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo/")))

  ;; But don't create stupid lockfiles
  (setq create-lockfiles nil)

  ;; History
  (setq savehist-file "~/.emacs.d/history"
	history-length t
	history-delete-duplicates t
	savehist-save-minibuffer-history 1
	savehist-additional-variables
	'(kill-ring
	  search-ring
	  regexp-search-ring)
	recentf-max-saved-items 50)
  (savehist-mode 1)
  (recentf-mode 1)

;; Which-key
;; C-x to access it

    (use-package which-key
     :straight t
     :config
      (which-key-mode t))

#+END_SRC

** more stuff

 #+BEGIN_SRC emacs-lisp

      ;;    (setq frame-title-format "emacs")
      ;;    (set-default 'cursor-type 'hbar)
      ;;      (ido-mode 1)
      ;;      (column-number-mode 1)
      ;;      (global-hl-line-mode 0)
      ;;      (delete-selection-mode +1)

   ;; Use xah brackets system, instead of 
   ;; electric-pairs, paredit, etc...
 
   ;; (setq electric-pair-pairs '(
   ;; 			   (?\{ . ?\})
   ;; 			   (?\( . ?\))
   ;; 			   (?\[ . ?\])
   ;; 			   (?\" . ?\")
   ;; 			   ))
   ;; (electric-pair-mode 1)

      ;;      (defalias 'yes-or-no-p 'y-or-n-p)
      ;;      (setq confirm-kill-processes nil)

      ;;    (add-hook 'prog-mode-hook 'turn-on-auto-fill)
      ;;    (add-hook 'text-mode-hook 'turn-on-auto-fill)

      ;; ;; Brent.Longborough's .emacs

      ;; (scroll-bar-mode -1) ; Disable hide scroll-bar
      ;; (tool-bar-mode 0) ; Disable tool bar
      ;; (blink-cursor-mode 0) ; Disable cursor blinking
      ;; (global-visual-line-mode 1); Proper line wrapping
      ;; (global-visual-line-mode 1); Proper line wrapping
      ;; ;; (if (display-graphic-p) (global-hl-line-mode t))
      ;; ;; (global-hl-line-mode 1); Highlight current row
      ;; (show-paren-mode 1); Matches parentheses and such in every mode
      ;; ;;(set-fringe-mode '(0 . 0)); Disable fringe because I use visual-line-mode
      ;; (set-fringe-mode '(4 . 0)) 
      ;; (set-face-background hl-line-face "#f2f1f0"); Same color as greyness in gtk
      ;; (setq inhibit-splash-screen t); Disable splash screen
      ;; (setq visible-bell t); Flashes on error
      ;; (setq calendar-week-start-day 1); Calender should start on Monday
      ;; (add-to-list 'default-frame-alist '(height . 59)); Default frame height.
      ;; (mapc 'global-unset-key [[up] [down] [left] [right]])

      ;; ;; Brent.Longborough upt to here

      ;;  ;;;; Uncomment up or down, but not the two parts

      ;;  (defun 1on1-set-cursor-type (cursor-type)
      ;;    "Set the cursor type of the selected frame to CURSOR-TYPE.
      ;;  When called interactively, prompt for the type to use.
      ;;  To get the frame's current cursor type, use `frame-parameters'."
      ;;    (interactive
      ;;     (list (intern (completing-read
      ;;  		   "Cursor type: "
      ;;  		   (mapcar 'list '("box" "hollow" "bar" "hbar" nil))))))
      ;;    (modify-frame-parameters (selected-frame) (list (cons 'cursor-type cursor-type))))

 #+END_SRC

** TODO mplayer-mode 

#+BEGIN_SRC emacs-lisp

	(add-to-list 'load-path "~/.emacs.d/local-repo/mplayer-mode/")
	(require 'mplayer-mode)

#+END_SRC

