emacs/.emacs.d/init.org
** org-babel 

#+BEGIN_SRC emacs-lisp

;; active Babel languages
(org-babel-do-load-languages
 'org-babel-load-languages
 (quote
  ((vala . t)
   (stan . t)
   (octave . t)
   (shen . t)
   (screen . t)
   (scheme . t)
   ;; (scala . t)
   (sass . t)
   (picolisp . t)
   (perl . t)
   (ocaml . t)
   (mscgen . t)
   (lilypond . t)
   (J . t)
   (ledger . t)
   (io . t)
   (hledger . t)
   (haskell . t)
   (fortran . t)
   (forth . t)
   (css . t)
   (maxima . t)
   (matlab . t)
   (emacs-lisp . t)
   (clojure . t)
   (awk . t)
   (makefile . t)
   (sqlite . t)
   (sql . t)
   (ruby . t)
   (R . t)
   (js . t)
   (java . t)
   (shell . t)
   (plantuml . t)
   (lisp . t)
   (latex . t)
   (gnuplot . t)
   (dot . t)
   (ditaa . t)
   (org . t)
   (calc . t)
   (C . t)
   (asymptote . t)
   (python . t)
   (emacs-lisp . t))))

   (setq org-confirm-babel-evaluate nil)
   (setq org-export-use-babel t)

#+END_SRC

** org-brain

#+BEGIN_SRC emacs-lisp

      (defun org-brain-insert-resource-icon (link)
	"Insert an icon, based on content of org-mode LINK."
	(insert (format "%s "
			(cond ((string-prefix-p "http" link)
			       (cond ((string-match "wikipedia\\.org" link)
				      (all-the-icons-faicon "wikipedia-w"))
				     ((string-match "github\\.com" link)
				      (all-the-icons-octicon "mark-github"))
				     ((string-match "vimeo\\.com" link)
				      (all-the-icons-faicon "vimeo"))
				     ((string-match "youtube\\.com" link)
				      (all-the-icons-faicon "youtube"))
				     (t
				      (all-the-icons-faicon "globe"))))
			      ((string-prefix-p "brain:" link)
			       (all-the-icons-fileicon "brain"))
			      (t
			       (all-the-icons-icon-for-file link))))))

      (add-hook 'org-brain-after-resource-button-functions #'org-brain-insert-resource-icon)

  (straight-use-package 'org-brain)
    (setq org-brain-path "~/org~/brain")

    ;; For Evil users
    (with-eval-after-load 'evil
      (evil-set-initial-state 'org-brain-visualize-mode 'emacs))
    (setq org-id-track-globally t)
    (setq org-brain-file-entries-use-title nil)
    (setq org-id-locations-file "~/org~/brain/.org-id-locations")
    ;; (push '("b" "Brain" plain (function org-brain-goto-end)
    ;;     "* %i%?")
    ;; 	   org-capture-templates)
    (setq org-brain-visualize-default-choices 'all)
    (setq org-brain-title-max-length 12)

#+END_SRC

** org-bullets
   
#+BEGIN_SRC emacs-lisp

  (straight-use-package 'org-bullets)
   (org-bullets-mode 1)
   (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

 #+END_SRC

** org-capture

#+BEGIN_SRC emacs-lisp

  ;; https://cestlaz.github.io/posts/using-emacs-24-capture-2/
    ;; This function pops up Capture templates options in a new emacs frame
    ;; You have to bound it to a desktop key to make it pops up wherever you 
    ;; need 

    (defun org-capture-popup ()
      "Create a new frame and run `org-capture'."
      (interactive)
      (select-frame (make-frame '((org-capture-popup . t))))
      (delete-other-windows)
      (cl-letf (((symbol-function 'switch-to-buffer-other-window) #'switch-to-buffer))
	(condition-case err
	    (org-capture)
	  ;; `org-capture' signals (error "Abort") when "q" is typed, so
	  ;; delete the newly-created frame in this scenario.
	  (error (when (equal err '(error "Abort"))
		   (delete-frame))))))

    (defadvice org-capture-finalize (after my-delete-capture-frame activate)
      "Delete the frame after `capture-finalize'."
      (when (frame-parameter nil 'org-capture-popup)
	(delete-frame)))

    (defadvice org-capture-destroy (after my-delete-capture-frame activate)
      "Delete the frame after `capture-destroy'."
      (when (frame-parameter nil 'org-capture-popup)
	(delete-frame)))

  ;; Capture templates start from here

	(global-set-key (kbd "C-c c") 'org-capture)

	(setq org-capture-templates

	  '(

    ("a" "Appointments" entry (file+headline "~/org~/my-appointments.org" "Calendar")
     "* APPT %^{Description} %^g\n%?\nAdded: %U")

       ("b" "Books" entry (file+headline "~/org~/books.org" "books to read")
     "* TODO %\\1 - %\\2%?\n%U\n:PROPERTIES:\n:NAME: %^{NAME}\n:TITLE: %^{TITLE}\n:END:\n")

      ;; you have to set up a template for this 
      ;; ("c" "Contacts" entry (file+headline "~/org~/contacts.org" "Contacts"), my/org-contacts-template :empty-lines 1)

       ("d" "Dreams" entry (file+datetree "~/org~/my-dreams.org") "* %^{Description} %^g %?\nAdded: %U")

       ("e" "Cookbook" entry (file "~/org~/cookbook.org")
	   "%(org-chef-get-recipe-from-url)"
	   :empty-lines 1)

       ("f" "Manual Cookbook" entry (file "~/org~/cookbook.org")
	   "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")

       ("j" "Journal" entry (file+datetree "~/org~/journal.org") "* %?\nEntered on %U\n  %i\n  %a")

       ("k" "Cliplink capture" entry (file "")
            "* TODO %(org-cliplink-capture) \n  SCHEDULED: %t\n" :empty-lines 1)

       ("l" "Log Time" entry (file+datetree "~/org~/timelog.org") "** %U - %^{Activity}  :TIME:")

       ("m" "Brain" entry (function org-brain-goto-end) "* %i%?" :empty-lines 1)

       ("n" "Notes" entry (file+datetree "~/org~/my-notes.org") "* %^{Description} %^g %?\nAdded: %U")

       ;; you have to set hugo up for this
       ;; ("o" "Posts" (file+datetree "~/org~/my-post.org") "* TODO %^{Description} %^g\n%?\nAdded: %U")

       ("t" "Tasks" entry (file+datetree "~/org~/tasks.org")
     "* TODO %^{Description} %^g\n%?\nAdded: %U")

       ;; example is in:
       ;; ~/.emacs.d/elpa/org-plus-contrib-20190520/org-contacts.el
       ("c" "Contacts" entry (file "~/org~/contacts.org")
	  "* %(org-contacts-template-name)

       :PROPERTIES:
       :WEBADDRESS:
       :EMAIL: 
       :PHONE:
       :FAX:
       :MOBILE:
       :BIRTHDAY:
       :ADDRESS:
       :NAME:
       :NICKNAME:
       :ALIAS:
       :ICON:
       :IGNORE:
       :NOTE:
       :END:")

       ("w" "Website" plain (function org-website-clipper) "* %a\n%T\n" :immediate-finish t)))

#+END_SRC

** org-capture with w3m or eww 

#+BEGIN_SRC emacs-lisp

;; org-eww and org-w3m should be in your org distribution, but see
;; note below on patch level of org-eww.

(require 'org-eww)
(require 'org-w3m)
(defvar org-website-page-archive-file "~/org~/capture.org")
(defun org-website-clipper ()
  "When capturing a website page, go to the right place in capture file,
   but do sneaky things. Because it's a w3m or eww page, we go
   ahead and insert the fixed-up page content, as I don't see a
   good way to do that from an org-capture template alone. Requires
   Emacs 25 and the 2017-02-12 or later patched version of org-eww.el."
 (interactive)

  ;; Check for acceptable major mode (w3m or eww) and set up a couple of
  ;; browser specific values. Error if unknown mode.

  (cond
   ((eq major-mode 'w3m-mode)
     (org-w3m-copy-for-org-mode))
   ((eq major-mode 'eww-mode)
     (org-eww-copy-for-org-mode))
   (t
     (error "Not valid -- must be in w3m or eww mode")))

  ;; Check if we have a full path to the archive file. 
  ;; Create any missing directories.

  (unless (file-exists-p org-website-page-archive-file)
    (let ((dir (file-name-directory org-website-page-archive-file)))
      (unless (file-exists-p dir)
	(make-directory dir))))

  ;; Open the archive file and yank in the content.
  ;; Headers are fixed up later by org-capture.

  (find-file org-website-page-archive-file)
  (goto-char (point-max))
  ;; Leave a blank line for org-capture to fill in
  ;; with a timestamp, URL, etc.
  (insert "\n\n")
  ;; Insert the web content but keep our place.
  (save-excursion (yank))
  ;; Don't keep the page info on the kill ring.
  ;; Also fix the yank pointer.
  (setq kill-ring (cdr kill-ring))
  (setq kill-ring-yank-pointer kill-ring)
  ;; Final repositioning.
  (forward-line -1))

#+END_SRC

** org-chef 

#+BEGIN_SRC emacs-lisp

(use-package org-chef
  :straight t)

#+END_SRC

