emacs/.emacs.d/init.org
** Org-cliplink

#+BEGIN_SRC emacs-lisp

  (use-package org-cliplink
   :straight t)

  (defun org-brain-cliplink-resource ()
    "Add a URL from the clipboard as an org-brain resource.
  Suggest the URL title as a description for resource."
    (interactive)
    (let ((url (org-cliplink-clipboard-content)))
      (org-brain-add-resource
       url
       (org-cliplink-retrieve-title-synchronously url)
       t)))

  (global-set-key (kbd "C-x p i") 'org-cliplink)

  ;; (define-key org-brain-visualize-mode-map (kbd "L") #'org-brain-cliplink-resource)

#+END_SRC

** org-drill

#+BEGIN_SRC emacs-lisp

(use-package org-drill
  :straight t)

#+END_SRC

** org-drill-table

 #+BEGIN_SRC emacs-lisp

 (use-package org-drill-table
   :straight t)

 #+END_SRC

** org-evil

 #+BEGIN_SRC emacs-lisp

(straight-use-package 'org-evil)

 #+END_SRC

** org hydra  
  
   org hydra function

 #+BEGIN_SRC emacs-lisp

 (defhydra hydra-org-state ()
	  ;; basic navigation
	  ("i" org-cycle)
	  ("I" org-shifttab)
	  ("h" org-up-element)
	  ("l" org-down-element)
	  ("j" org-forward-element)
	  ("k" org-backward-element)
	  ;; navigating links
	  ("n" org-next-link)
	  ("p" org-previous-link)
	  ("o" org-open-at-point)
	  ;; navigation blocks
	  ("N" org-next-block)
	  ("P" org-previous-block)
	  ;; updates
	  ("." org-ctrl-c-ctrl-c)
	  ("*" org-ctrl-c-star)
	  ("-" org-ctrl-c-minus)
	  ;; change todo state
	  ("H" org-shiftleft)
	  ("L" org-shiftright)
	  ("J" org-shiftdown)
	  ("K" org-shiftup)
	  ("t" org-todo))

 #+END_SRC

** org-journal 

#+BEGIN_SRC emacs-lisp

;; https://github.com/bastibe/org-journal

(use-package org-journal
 :ensure t)

    (customize-set-variable 'org-journal-dir "~/org~/journal/")
    (customize-set-variable 'org-journal-date-format "%A, %d %B %Y")

    (customize-set-variable 'org-journal-enable-agenda-integration t)
    (customize-set-variable 'org-journal-carryover-items nil)
    (customize-set-variable 'org-journal-enable-agenda-integration t)

(setq org-journal-enable-agenda-integration t
      org-icalendar-store-UID t
      org-icalendar-include-todo "all"
      org-icalendar-combined-agenda-file "~/org~/org-journal.ics")

(global-set-key (kbd "C-c C-v") 'org-journal-search)
(global-set-key (kbd "C-c C-g") 'org-journal-open-next-entry)
(global-set-key (kbd "C-c C-h") 'org-journal-open-previous-entry)
(global-set-key (kbd "C-c j") 'org-journal-new-entry)

#+END_SRC

** org-mac-link

#+BEGIN_SRC emacs-lisp

(add-hook 'org-mode-hook (lambda () 
  (define-key org-mode-map (kbd "C-c g") 'org-mac-grab-link)))

#+END_SRC

** org-mind-map

#+BEGIN_SRC emacs-lisp

;; (use-package org-mind-map
;;   :init
;;   (require 'ox-org)
;;   :straight t
;;   ;; Uncomment the below if 'ensure-system-packages` is installed
;;   ensure-system-package (gvgen . graphviz)
;;   :config
;;      (setq org-mind-map-engine "dot")    ; Default. Directed Graph
;;   ;; (setq org-mind-map-engine "neato")  ; Undirected Spring Graph
;;   ;; (setq org-mind-map-engine "twopi")  ; Radial Layout
;;      (setq org-mind-map-engine "fdp")    ; Undirected Spring Force-Directed
;;   ;; (setq org-mind-map-engine "sfdp")   ; Multiscale version of fdp for the layout of large graphs
;;   ;; (setq org-mind-map-engine "circo")  ; Circular Layout
;;      )

 (use-package org-mind-map
     :straight t
     :init
     (require 'ox-org))

#+END_SRC

** org-super-agenda

    Display groups in org-agenda to make things a bit more organized.

#+BEGIN_SRC emacs-lisp

(use-package org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode)

  (setq
   org-super-agenda-header-separator ""
   org-super-agenda-unmatched-name "Other"
   org-super-agenda-groups
   '(
     ;; Each group has an implicit OR operator between its selectors.
     (:name "Today"  ; Optionally specify section name
            :time-grid t  ; Items that appear on the time grid.
            :todo "TODAY"   ; Items that have this todo keyword.
            )
     (:name "Work"
            :category "work"
            :tag "work"
            )
     (:name "High Priority"
            :priority "A"
            :order 1
            )
     (:name "Physical"
            :category "physical"
            :tag "physical"
            :order 2
            )
     (:name "Shopping List"
            :category "shopping"
            :tag "shopping"
            :order 3
            )
     (:name "Cleaning"
            :category "cleaning"
            :tag "cleaning"
            :order 4
            )
     (:name "Hygiene"
            :category "hygiene"
            :tag "hygiene"
            :order 5
            )
     (:name "Health"
            :category "health"
            :tag "health"
            :order 6
            )
     (:name "Financial"
            :category "financial"
            :tag "financial"
            :order 7
            )

     ;; After the last group, the agenda will display items that didn't
     ;; match any of these groups, with the default order position of 99

     (:name "Tech"
            :category "tech"
            :tag "tech"
            :order 180
            )
     (:name "To Read"
            :category "read"
            :tag "read"
            :order 181
            )
     (:name "To Watch"
            :category "watch"
            :tag "watch"
            :order 182
            )
     (:todo "WAITING" :order 190)
     ;; (:name "Low priority"
     ;;        :priority "C"
     ;;        :order 200)
     )))

#+END_SRC

** org-present

#+BEGIN_SRC emacs-lisp

(use-package org-present
 :straight t
 :config
  (setq org-present-text-scale 15)
  (add-hook 'org-present-mode-hook
  (defun org-present/start ()
  (org-present-big)
  (org-present-read-only)))
  (add-hook 'org-present-mode-quit-hook
  (defun org-present/start ()
  (org-present-small)
  (org-present-read-write))))

#+END_SRC

** org-present-remote

#+BEGIN_SRC emacs-lisp

(use-package org-present-remote
 :straight t)

(use-package fakir
 :straight t)

#+END_SRC

** org-protocol

#+BEGIN_SRC emacs-lisp

(require 'org-protocol)

#+END_SRC

** org-recur

#+begin_src emacs-lisp

;; Recurring org-mode tasks.

(use-package org-recur
  :after org
  :bind (
         :map org-recur-mode-map

         ("C-c d" . org-recur-finish)
         ("C-c 0" . org-recur-schedule-today)
         ("C-c 1" . org-recur-schedule-1)
         ("C-c 2" . org-recur-schedule-2)

         :map org-recur-agenda-mode-map

         ;; Rebind the 'd' key in org-agenda (default: `org-agenda-day-view').
         ("d" . org-recur-finish)
         ("0" . org-recur-schedule-today)
         ("1" . org-recur-schedule-1)
         ("2" . org-recur-schedule-2)
         ("C-c d" . org-recur-finish)
         ("C-c 0" . org-recur-schedule-today)
         ("C-c 1" . org-recur-schedule-1)
         ("C-c 2" . org-recur-schedule-2)
         )
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))
  :demand t
  :config
  (defun org-recur-schedule-1 ()
    (interactive)
    (org-recur-schedule-date "|+1|"))
  (defun org-recur-schedule-2 ()
    (interactive)
    (org-recur-schedule-date "|+2|"))

  (setq org-recur-finish-done t
        org-recur-finish-archive t)
  )

#+end_src

** org-refile

#+BEGIN_SRC emacs-lisp

(setq org-refile-targets '((nil :maxlevel . 9)
                                (org-agenda-files :maxlevel . 9)))
(setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
(setq org-refile-use-outline-path t)                  ; Show full paths for refiling

#+END_SRC

** org-re-reveal

#+BEGIN_SRC emacs-lisp

(use-package org-re-reveal 
   :straight t
   :config
     (setq org-re-reveal-root "file:/home/vagner/reveal-slides/reveal.js")
     (require 'org-re-reveal)
;;     (setq oer-reveal-plugins t)
     (setq org-re-reveal-hlevel 2))

#+END_SRC

** org-re-reveal-ref

#+BEGIN_SRC emacs-lisp

(use-package org-re-reveal-ref
 :straight t
 :config
   (require 'org-re-reveal-ref))

#+END_SRC

