emacs/.emacs.d/init.org
** org-reveal

#+BEGIN_SRC emacs-lisp

;; Note: give the ABSOLUTE PATH to reveal.js
;; Otherwise it will not work

;; this work only with internet connection
;; (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
;; (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")

;; this work without internet connection
;; (setq org-reveal-root "file:/home/vagner/reveal-slides/reveal.js")

;; if it does not load, do:
;; Alt-x load-library RET ox-reveal

 (use-package ox-reveal
  :straight t
  :after org
  :custom
  (org-reveal-root "file:/home/vagner/reveal-slides/reveal.js"))

 (use-package htmlize
  :straight t
  :after ox-reveal
  :config
  (setq org-reveal-hlevel 2)
  (setq org-reveal-mathjax t))

    ;; To load Org-reveal, type “Alt-x load-library”, then type “ox-reveal”.
    ;; ~/reveal-slides/reveal.js$ npm start - you have to start the server
    ;; for viewing your slides and using the remote control
    ;; Now you can export this manual into Reveal.js presentation by typing “C-c C-e R B”.
    ;; Open the generated “Readme.html” in your browser and enjoy the cool slides.

#+END_SRC

** org-super-agenda

#+begin_src emacs-lisp

  ;; Display groups in org-agenda to make things a bit more organized.

  (use-package org-super-agenda
    :after org-agenda
    :config
    (org-super-agenda-mode)
    (setq
     org-super-agenda-header-separator ""
     org-super-agenda-unmatched-name "Other"
     org-super-agenda-groups
     '(
       ;; Each group has an implicit OR operator between its selectors.
       (:name "Cleaning"
              :category "cleaning"
              :tag "cleaning"
              :order 4
              )
       (:name "Financial"
              :category "financial"
              :tag "financial"
              :order 7
              )
       (:name "Health"
              :category "health"
              :tag "health"
              :order 6
              )
       (:name "High Priority"
              :priority "A"
              :order 1
              )
       (:name "Hygiene"
              :category "hygiene"
              :tag "hygiene"
              :order 5
              )
       (:name "Physical"
              :category "physical"
              :tag "physical"
              :order 2
              )
       (:name "Shopping List"
              :category "shopping"
              :tag "shopping"
              :order 3
              )
       (:name "Today"  ; Optionally specify section name
              :time-grid t  ; Items that appear on the time grid.
              :todo "TODAY"   ; Items that have this todo keyword.
              )
       (:name "Work"
              :category "work"
              :tag "work"
              )
       ;; After the last group, the agenda will display items that didn't
       ;; match any of these groups, with the default order position of 99
       (:name "To Read"
              :category "read"
              :tag "read"
              :order 181
              )
       (:name "Tech"
              :category "tech"
              :tag "tech"
              :order 180
              )
       (:name "To Watch"
              :category "watch"
              :tag "watch"
              :order 182
              )
       (:todo "WAITING" :order 190)
       ;; (:name "Low priority"
       ;;        :priority "C"
       ;;        :order 200)
       )))

#+end_src

** org-tree-slide

#+BEGIN_SRC emacs-lisp

(use-package org-tree-slide
     :straight t
     :config
     (add-hook 'org-tree-slide-mode-hook
	       (lambda ()
		 (if org-tree-slide-mode
		     ;; When mode is enabled
		     (progn (setq wolfe--enable-transient-map t)
			    (wolfe/org-tree-set-transient-map))
		   ;; When mode is disabled
		   (setq wolfe--enable-transient-map nil)))))

(defun wolfe/org-tree-set-transient-map ()
     (interactive)
     (if wolfe--enable-transient-map
	 (let ((map (make-sparse-keymap)))
	   (define-key map (kbd "<right>") 'org-tree-slide-move-next-tree)
	   (define-key map (kbd "<left>")  'org-tree-slide-move-previous-tree)
	   (define-key map (kbd "<up>")    'org-tree-slide-content)
	   (define-key map (kbd "<down>")  'org-tree-slide-display-header-toggle)
	   (set-transient-map map nil 'wolfe/org-tree-set-transient-map))
       (makeunbound wolfe--enable-transient-map)))

#+END_SRC

** origami

#+BEGIN_SRC emacs-lisp

;; (use-package origami
;; :straight t)

#+END_SRC

** ox-pandoc

#+BEGIN_SRC emacs-lisp

(use-package ox-pandoc 
	   :straight t)

#+END_SRC

** ox-spectacle

#+BEGIN_SRC emacs-lisp

(use-package ox-spectacle
      :straight t)

#+END_SRC

** pastbin

#+BEGIN_SRC emacs-lisp :tangle yes

(straight-use-package 'debpaste)
(straight-use-package 'ix)

#+END_SRC

** pdf-tools

#+BEGIN_SRC emacs-lisp

(use-package pdf-tools
 :straight t
 :config
  (pdf-tools-install))

(use-package org-pdfview
 :straight t)

#+END_SRC

** persistent-soft

#+BEGIN_SRC emacs-lisp

(use-package persistent-soft
  :straight t
  :config
(persistent-soft-store 'hundred 100 "mydatastore")
(persistent-soft-fetch 'hundred "mydatastore")    ; 100
(persistent-soft-fetch 'thousand "mydatastore"))   ; nil

;; quit and restart Emacs

(persistent-soft-fetch 'hundred "mydatastore")    ; 100

#+END_SRC

** perspective

#+BEGIN_SRC emacs-lisp

 (use-package perspective
   :straight t)

#+END_SRC

** php-ext

#+BEGIN_SRC emacs-lisp

(setq php-ext-path "~/.emacs.d/local-repo/php-ext/")
(load (concat php-ext-path "php-ext.el"))

   ;; (add-to-list 'load-path "~/.emacs.d/local-repo/php-ext")
   ;; (require 'php-ext)

#+END_SRC

** php-mode 

#+BEGIN_SRC emacs-lisp

(use-package php-mode
    :straight t)

  (use-package ac-php
    :straight t)

(use-package phpunit  
    :straight t
    :config
    (setq phpunit-configuration-file "phpnit.xml")
    (setq phpunit-root-directory "./"))

  (use-package php-auto-yasnippets
    :straight t)

#+END_SRC

** plantuml

#+BEGIN_SRC emacs-lisp

  (setq org-plantuml-jar-path "/usr/share/plantuml/plantuml.jar")

  (dolist (pkgname '(plantuml-mode
flycheck-plantuml))
  (straight-use-package pkgname))

#+END_SRC

** poetry

#+BEGIN_SRC emacs-lisp

;; It is not the same poetry package for writing poetry
;; it is an interface for python poetry package tool

   (use-package poetry
    :straight t)

;; This is the poetry-rhyme for writing poetry
;; you need to install the rhyme cli 
;; you have to install "~/Downloand/rhyme_4_poetry.el

(add-to-list 'load-path "~/.emacs.d/local-repo/poetry")
(require 'poetry)

;; (load-library "~/.emacs.d/local-repo/poetry.elc")

#+END_SRC

** poly-markdown

#+BEGIN_SRC emacs-lisp

(use-package poly-markdown
  :straight t
  :config 
(add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode)))

#+END_SRC

** powerline

#+BEGIN_SRC emacs-lisp

   (use-package powerline 
    :straight t)

(require 'powerline)
(powerline-default-theme)

  ;; (powerline-center-theme)
  ;; (setq powerline-center-default-separator 'wave))

#+END_SRC

** prolog

#+BEGIN_SRC emacs-lisp

(autoload 'run-prolog "prolog" "Start a Prolog sub-process." t)
(autoload 'prolog-mode "prolog" "Major mode for editing Prolog programs." t)
(autoload 'mercury-mode "prolog" "Major mode for editing Mercury programs." t)
(setq prolog-system 'swi)
(setq auto-mode-alist (append '(("\\.pl$" . prolog-mode)
				("\\.m$" . mercury-mode))
			       auto-mode-alist))

#+END_SRC

** python

python3 interpreter 

#+begin_src emacs-lisp

(setq python-shell-interpreter "/usr/bin/python3")

(use-package evil-python-movement
 :ensure t)

#+end_src

** quelpa

 #+BEGIN_SRC emacs-lisp


   ;; (use-package quelpa-use-package
   ;;     :straight t
   ;;     :init
   ;;    (setq quelpa-update-melpa-p nil))

 #+END_SRC
 
** re-builder

#+BEGIN_SRC emacs-lisp

   (use-package re-builder
    :straight t
    :config
    (setq reb-re-syntax 'string))

#+END_SRC

** restart-emacs

#+BEGIN_SRC emacs-lisp

     (use-package restart-emacs
       :ensure t)

#+END_SRC

** ripgrep

#+BEGIN_SRC emacs-lisp

     (use-package ripgrep
       :straight t)

#+END_SRC

