emacs/.emacs.d/init.org
** rust

- https://hoverbear.org/blog/setting-up-a-rust-devenv/
- http://julienblanchard.com/2016/fancy-rust-development-with-emacs/

#+BEGIN_SRC emacs-lisp

     (use-package rust-mode
       :ensure t
       :config
       (setq rust-format-on-save t)
       (add-hook 'rust-mode-hook
          (lambda () (setq indent-tabs-mode nil)))
       (add-hook 'rust-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c <tab>") #'rust-format-buffer))))

(require 'rust-mode)

(defun indent-buffer ()
  "Indent current buffer according to major mode."
  (interactive)
  (indent-region (point-min) (point-max)))

(use-package cargo
 :ensure t
 :config
(setq racer-cmd "~/.cargo/bin/cargo") ;; cargo binaries PATH
(add-hook 'rust-mode-hook 'cargo-minor-mode))

;; https://github.com/racer-rust/emacs-racer
(use-package racer
 :ensure t
 :config
 (setq racer-cmd "~/.cargo/bin/racer") ;; rustup binaries PATH
 (setq racer-rust-src-path "~/rust/src") ;; Rust  source code PATH
 (add-hook 'rust-mode-hook #'racer-mode)
 (add-hook 'racer-mode-hook #'eldoc-mode)
 )

(use-package flycheck-rust
 :ensure t
 :config
 (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

(setenv "PATH" (concat (getenv "PATH") ":" (expand-file-name "~/.cargo/bin")))
(setq exec-path (append exec-path (list (expand-file-name "~/.cargo/bin"))))

#+END_SRC

** save-place 

;; Keep point position between re-opening files with recentf/ido  

#+BEGIN_SRC emacs-lisp

   (require 'saveplace)
   (save-place-mode 1)

#+END_SRC

** TODO scheme 

#+BEGIN_SRC emacs-lisp

#+END_SRC

** shackle-rules

#+BEGIN_SRC emacs-lisp

  ;; (setq shackle-rules
  ;;      '(((svg-2048-mode circe-query-mode) :same t)
  ;;        ("*Help*" :align t :select t)
  ;;        ("\\`\\*helm.*?\\*\\'" :regexp t :align t)
  ;;        ((compilation-mode "\\`\\*firestarter\\*\\'"
  ;; 	 "\\`\\*magit-diff: .*?\\'") :regexp t :noselect t)
  ;;        ("\\`\\*cider-repl .*" :regexp t :align t :size 0.2)
  ;;        ((inferior-scheme-mode "*shell*" "*eshell*") :popup t))
  ;;       shackle-default-rule '(:select t)
  ;;       shackle-default-size 0.4
  ;;       shackle-inhibit-window-quit-on-same-windows t)

#+END_SRC

** shell-pop

#+BEGIN_SRC emacs-lisp

(use-package shell-pop
:straight t
  :bind (("C-t" . shell-pop))
  :config
  (setq shell-pop-shell-type (quote ("ehell" "eshell" (lambda nil (eshell)))))
  (setq shell-pop-term-shell "eshell")
  ;; need to do this manually or not picked up by `shell-pop'
  (shell-pop--set-shell-type 'shell-pop-shell-type shell-pop-shell-type))

#+END_SRC

** simple-mpc 

#+BEGIN_SRC emacs-lisp

(use-package simple-mpc
 :straight t)

#+END_SRC

** slime swank

#+BEGIN_SRC emacs-lisp

  ;; ;; Set your lisp system and, optionally, some contribs

  ;; ;; (setq inferior-lisp-program "/usr/bin/sbcl")
  ;; ;; Install sbcl from github sources and NOT with apt
  ;;     (setq inferior-lisp-program "/usr/local/bin/sbcl")

  ;;   ;; update this path to the correct location.

  ;;   ;; (add-to-list 'load-path "/usr/share/emacs/site-lisp/elpa-src/slime-2.23/")

  ;;   ;; (add-to-list 'load-path "~/.emacs.d/elpa/slime-repl-ansi-color-20190426.1414/")

  ;;   (add-to-list 'load-path "~/.emacs.d/straight/repos/slime/")

  ;;   (require 'slime-autoloads)

  ;;   (defun cliki:start-slime ()
  ;; 	(unless (slime-connected-p)
  ;; 	  (save-excursion (slime))))
  ;;   (add-hook 'slime-mode-hook 'cliki:start-slime)

  ;;   (eval-after-load "slime"
  ;;     '(progn
  ;;       ;; (add-to-list 'load-path "/usr/share/emacs/site-lisp/elpa-src/slime-3.23/contrib/")
  ;;       ;; (add-to-list 'load-path "~/.emacs.d/elpa/slime-20190319.930/contrib")
  ;;       (add-to-list 'load-path "~/.emacs.d/straight/build/slime/contrib/")
  ;;        (slime-setup '(slime-fancy slime-banner))
  ;;       (setq slime-complete-symbol*-fancy t)
  ;;       (setq slime-complete-symbol-function 'slime-fuzzy-complete-symbol)))

  ;;   (require 'slime-autoloads)
  ;;   (setq slime-contribs '(slime-repl))

(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)
(add-hook 'emacs-lisp-mode-hook 'company-mode)

(use-package slime
  :straight t
  :load-path
   ("~/.emacs.d/straight/repos/slime/")
  :config
  (setq inferior-lisp-program "/usr/local/bin/sbcl")
  (setq slime-contribs '(slime-fancy)))
  (require 'slime-autoloads)

(use-package slime-company
  :straight t
  :init
    (require 'company)
    (slime-setup '(slime-fancy slime-company)))

#+END_SRC

** smartparens

#+BEGIN_SRC emacs-lisp
    (use-package smartparens
      :straight t
      :config
      ;; Activate smartparens globally
      (smartparens-global-mode t)
      (show-smartparens-global-mode t)
    
      ;; Activate smartparens in minibuffer
      (add-hook 'eval-expression-minibuffer-setup-hook #'smartparens-mode)
    
      ;; Do not pair simple quotes
      (sp-pair "'" nil :actions :rem))

#+END_SRC

** smex

   if you enable this, you have to disable the helm global-key that is binded
   to "M-x" as well

#+BEGIN_SRC emacs-lisp

;;    (global-set-key (kbd "M-x") 'smex)
;;    (global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)

#+END_SRC

** sudo-editing

#+BEGIN_SRC emacs-lisp :tangle yes

(use-package sudo-edit
  :ensure t
  :bind
    ("s-e" . sudo-edit))

#+END_SRC

** synonyms and thesaurus

you have to comment 'disabled' keyword to use this package

#+BEGIN_SRC emacs-lisp

(use-package synonyms
  :straight t
  :disabled
  :init
  :config
  (setq synonyms-file "~/thesaurus/mthesaur.txt")
  (setq synonyms-file "~/thesaurus/brazilian-synonyms.txt")
  (setq synonyms-cache-file "~/thesaurus/thes.cache")
  (global-set-key (kbd "C-*") 'synonyms))

;;  (evil-leader/set-key "sy" 'synonyms))

(use-package powerthesaurus
  :straight t
  :config
  (defun powerthesaurus-lookup-word-at-point ()
    "Find the word at point synonyms at powerthesaurus.org."
    (interactive)
    (if (region-active-p)
	(powerthesaurus-lookup-word (region-beginning) (region-end))
      (save-mark-and-excursion
	(when (not (looking-at "\\<"))
	  (backward-word))
	(set-mark (point))
	(forward-word)
	(activate-mark)
	(powerthesaurus-lookup-word (region-beginning) (region-end)))))
    (global-set-key (kbd "C-M-x") 'powerthesaurus-lookup-word-at-point)
    (global-set-key (kbd "C-M-y") 'powerthesaurus-lookup-word))

;;  (evil-leader/set-key "s" 'powerthesaurus-lookup-word-at-point)
;;  (evil-leader/set-key "S" 'powerthesaurus-lookup-word))

#+END_SRC

** tab on console 

  tab fold on console
  put this before evil

#+BEGIN_SRC emacs-lisp

    (setq evil-want-keybinding nil)
 ;; (setq evil-want-C-i-jump nil)
    (unless (display-graphic-p) (setq evil-want-C-i-jump nil))
    
;; (when evil-want-C-i-jump
  ;; (define-key evil-motion-state-map (kbd "C-i") 'evil-jump-forward))

#+END_SRC

** telega

  https://github.com/zevlg/telega.el/blob/master/README.md
  https://medium.com/@ajsb85/building-the-telegram-library-80afe68054c9
  
  see the folder "~/Downloads/telega_setup"

#+BEGIN_SRC emacs-lisp

(use-package telega
 :straight t
 :bind 
  (:map telega-msg-button-map
    ("j" . nil)
    ("k" . nil)
    ("h" . nil)
    ("l" . nil))
    :custom (telega-notifications-mode t))

#+END_SRC

** text-scale

#+BEGIN_SRC emacs-lisp

(global-set-key (kbd "C-M-=") 'default-text-scale-increase)
(global-set-key (kbd "C-M--") 'default-text-scale-decrease)

#+END_SRC

** theme-magic 

you have to install pywall for this to work 
https://github.com/jcaw/theme-magic

#+begin_src emacs-lisp :tangle yes

  ;;   (use-package theme-magic
  ;;    :ensure t)

  ;; (require 'theme-magic)
  ;; (theme-magic-export-theme-mode)

#+end_src

** time in modeline

#+BEGIN_SRC emacs-lisp

(setq display-time-default-load-average nil)
(setq display-time-interval 1)
(setq display-time-format "%d|%m-%a|%r")
(display-time-mode +1)

#+END_SRC

** tiny-tools

#+begin_src emacs-lisp 

 (add-to-list 'load-path "~/.emacs.d/local-repo/tiny-tools")
 (add-to-list 'load-path "~/.emacs.d/local-repo/tiny-tools/lisp/tiny")
            (add-to-list 'load-path "~/.emacs.d/local-repo/tiny-tools/lisp/other")

(require 'tinyurl)
(tinyurl-mode 1)

#+end_src

** toggle-truncate-lines 

truncate-partial-width-windows is a variable defined in ‘C source
code’.
A value of nil means to respect the value of ‘truncate-lines’.
You can customize this variable

#+BEGIN_SRC emacs-lisp

(setq truncate-partial-width-windows 1)
(setq truncate-lines 1)
(global-set-key (kbd "C-x t") 'toggle-truncate-lines)

#+END_SRC

** tramp

#+BEGIN_SRC emacs-lisp
  
 (use-package tramp
       :init
       (setq tramp-default-method "ssh")
       (setq password-cache-expiry nil)
       :config

       (add-to-list 'tramp-remote-path "~/"))

#+END_SRC

** translation 
