emacs/.emacs.d/init.org
*** ob-translate

  ;; https://github.com/alphapapa/ob-translate  
  ;; M-x package-install RET ob-translate
  ;; enclose your code between source and call

  ;; #+BEGIN_SRC translate :dest il,el,it,fr,ru,en (etc.)
  ;; or
  ;; #+BEGIN_SRC translate :src il (or 'auto' for auto detection)
  ;; $ContentsHere
  ;; #+END_SRC
  ;; Example: 
  ;; #+BEGIN_SRC translate :src en  :dest he,el,la
  ;;   light
  ;; #+END_SRC
  ;; then you can hit "C-c C-v e" to execute the code
  ;; org-babel-execute-src-block

#+BEGIN_SRC emacs-lisp

      (use-package ob-translate
       :straight t)
      (define-key org-mode-map (kbd "C-c C-v e") 'org-babel-execute-src-block)

;; https://orgmode.org/manual/Evaluating-code-blocks.html#DOCF142
;; I don't want to execute code blocks with C-c C-c
(setq org-babel-no-eval-on-ctrl-c-ctrl-c t)

#+END_SRC

*** google-translate 

#+BEGIN_SRC emacs-lisp

(use-package google-translate
:straight t
:config
  (bind-keys*
  ("C-c t" . google-translate-at-point)
  ("C-c T" . google-translate-at-point-reverse)))

(defun google-translate--get-b-d1 ()
      (list 432928 274893998))

#+END_SRC

** treemacs

#+BEGIN_SRC emacs-lisp

#+END_SRC

** trident - lisp2javascript

#+BEGIN_SRC emacs-lisp

  ;; (add-to-list 'auto-mode-alist (cons "\\.paren\\'" 'lisp-mode))
  ;; (add-hook 'lisp-mode-hook
  ;; 	  #'(lambda ()
  ;; 	      (when (and buffer-file-name
  ;; 			 (string-match-p "\\.paren\\>" buffer-file-name))
  ;; 		(unless (slime-connected-p)
  ;; 		  (save-excursion (slime)))
  ;; 		(trident-mode +1))))

  ;;     ;; (use-package :parenscript)

  ;;     ;; issue this command in the REPl:
  ;;     ;; (ql:quickload :parenscript)
  ;;     ;; Then you can use "trident-expand-buffer" 
  ;;     ;; etc...

#+END_SRC

** Unicode-fonts

#+BEGIN_SRC emacs-lisp

(use-package unicode-fonts
 :straight t
 :config
 (unicode-fonts-setup))

#+END_SRC

** virtualenvwrapper

#+BEGIN_SRC emacs-lisp

(use-package virtualenvwrapper
:straight t
:config
(venv-initialize-interactive-shells)
(venv-initialize-eshell))

#+END_SRC

** visual-regexp-steroids

;; you have to issue: Ctrl-x m RET vr/  to see the command
;; if the files are not already in the load path

#+BEGIN_SRC emacs-lisp

(add-to-list 'load-path "~/.emacs.d/elpa/visual-regexp-20170301.116/")
(add-to-list 'load-path "~/.emacs.d/elpa/visual-regexp-steroids-20170222.253")
(require 'visual-regexp)
(require 'visual-regexp-steroids)
(define-key global-map (kbd "C-c r") 'vr/replace)
(define-key global-map (kbd "C-c q") 'vr/query-replace)
;; if you use multiple-cursors, this is for you:
(define-key global-map (kbd "C-c m") 'vr/mc-mark)
;; to use visual-regexp-steroids's isearch instead of the built-in regexp isearch, also include the following lines:
(define-key esc-map (kbd "C-r") 'vr/isearch-backward) ;; C-M-r
(define-key esc-map (kbd "C-s") 'vr/isearch-forward) ;; C-M-s

#+END_SRC

** wanderlust email-client

#+BEGIN_SRC emacs-lisp

(autoload 'wl "wl" "Wanderlust" t)

;; apt install bbdb 


;; (autoload 'wl "wl" "Wanderlust" t)

;;; bbbd for managing address book on wanderlust
;;; https://emacs-fu.blogspot.com.br/2009/08/managing-e-mail-addresses-with-bbdb.html

(setq bbdb-file "~/.emacs.d/bbdb")           ;; keep ~/ clean; set before loading
;; (bbdb-initialize)
(setq 
    bbdb-offer-save 1                        ;; 1 means save-without-asking

bbdb-use-pop-up t                        ;; allow popups for addresses
;; bbdb-electric-p t                        ;; be disposable with SPC
bbdb-popup-target-lines  1               ;; very small

bbdb-dwim-net-address-allow-redundancy t ;; always use full name
bbdb-quiet-about-name-mismatches 2       ;; show name-mismatches 2 secs

bbdb-always-add-address t                ;; add new addresses to existing...
					 ;; ...contacts automatically
bbdb-canonicalize-redundant-nets-p t     ;; x@foo.bar.cx => x@bar.cx

bbdb-completion-type nil                 ;; complete on anything

bbdb-complete-name-allow-cycling t       ;; cycle through matches
					 ;; this only works partially

bbbd-message-caching-enabled t           ;; be fast
bbdb-use-alternate-names t               ;; use AKA

bbdb-elided-display t                    ;; single-line addresses

;; auto-create addresses from mail
bbdb/mail-auto-create-p 'bbdb-ignore-some-messages-hook   
bbdb-ignore-some-messages-alist ;; don't ask about fake addresses
;; NOTE: there can be only one entry per header (such as To, From)
;; http://flex.ee.uec.ac.jp/texi/bbdb/bbdb_11.html

'(( "From" . "no.?reply\\|DAEMON\\|daemon\\|facebookmail\\|twitter"))
)

 (add-hook 'gnus-startup-hook 'bbdb-insinuate-gnus)

#+END_SRC

** web-mode 

#+BEGIN_SRC emacs-lisp

(use-package web-mode
  :straight t
  :mode
  ("\\.phtml\\'" "\\.tpl\\.php\\'" "\\.[agj]sp\\'" "\\.as[cp]x\\'"
  "\\.erb\\'" "\\.mustache\\'" "\\.djhtml\\'" "\\.html?\\'")

  :init
  (setq web-mode-markup-indent-offset 2
        web-mode-code-indent-offset 2
        web-mode-css-indent-offset 2

        web-mode-enable-auto-pairing t
        web-mode-enable-auto-expanding t
        web-mode-enable-css-colorization t)

  :config
  ;; Template
  (setq web-mode-engines-alist
        '(("php"    . "\\.phtml\\'")
          ("blade"  . "\\.blade\\."))
        )

  )

(use-package web-beautify
  :straight t
  :commands (web-beautify-css
             web-beautify-css-buffer
             web-beautify-html
             web-beautify-html-buffer
             web-beautify-js
             web-beautify-js-buffer))

(use-package web-completion-data :straight t)
(use-package web-mode-edit-element :straight t)

#+END_SRC

** wgrep 

#+BEGIN_SRC emacs-lisp

(use-package wgrep
 :straight t)

#+END_SRC

** winner-mode

#+BEGIN_SRC emacs-lisp

(when (fboundp 'winner-mode)
     (winner-mode 1))

#+END_SRC

** yasnippets

;; yasnippet code 'optional', before auto-complete

   if it complains, copy make a snippet directory inside the
   complaining yasnippet error

#+BEGIN_SRC emacs-lisp

(dolist (pkgname '(snippet
yasnippet
yasnippet-snippets
yasnippet-classic-snippets))
  (straight-use-package pkgname))

  (yas-global-mode 1)

#+END_SRC

** youtube-dl

#+BEGIN_SRC emacs-lisp

(add-to-list 'load-path "~/.emacs.d/local-repo/youtube-dl-emacs")
(require 'youtube-dl)

#+END_SRC

** zoom-frm for hycontrol

see also doremi packages 
https://www.emacswiki.org/emacs/DoReMi

#+BEGIN_SRC emacs-lisp

    (add-to-list 'load-path "~/.emacs.d/local-repo/zoom-frm")
    (require 'zoom-frm)

    (define-key ctl-x-map [(control ?+)] 'zoom-in/out)
    (define-key ctl-x-map [(control ?-)] 'zoom-in/out)
    (define-key ctl-x-map [(control ?=)] 'zoom-in/out)
    (define-key ctl-x-map [(control ?0)] 'zoom-in/out)

#+END_SRC



#+begin_src emacs-lisp

  (use-package restart-emacs
   :ensure t)

#+end_src

** hyperspec-lookup

#+begin_src emacs-lisp 

(global-set-key "\C-cH" 'hyperspec-lookup)

#+end_src

** ecb

http://ecb.sourceforge.net/

#+begin_src emacs-lisp :tangle yes

(straight-use-package 'ecb)
(require 'ecb)

#+end_src

** cedet

http://alexott.net/en/writings/emacs-devenv/EmacsCedet.html

#+begin_src emacs-lisp :tangle yes

(semantic-mode 1)
(require 'semantic/ia)

#+end_src

* People with great emacs configs

 List of people with nice emacs dotfiles files
 and some video tutorials:
 https://github.com/munen/emacs.d
 https://www.reddit.com/r/emacs/comments/8128z5/whose_dotfiles_do_you_steal_from/
 https://github.com/purcell/emacs.d - this one is great for introducing emacs to people
 https://github.com/suvratapte - it is a great option for emacs minimal
 https://www.gtrun.org/custom/init.html
 https://github.com/daedreth/UncleDavesEmacs
 https://github.com/dakra/dmacs
 https://github.com/valignatev/dotfiles
 https://invidio.us/latest_version?id=FYPE0dIoq1I&itag=43
 [[https://cestlaz.github.io/stories/emacs/]] 
 http://www.coli.uni-saarland.de/~slemaguer/emacs/main.html
 https://zzamboni.org/post/my-emacs-configuration-with-commentary/
 https://github.com/caisah/emacs.dz
 https://github.com/DiegoVicen/my-emacs#my-blog-publishing-configuration
 https://github.com/myTerminal/super-emacs
 https://github.com/mwfogleman/config/blob/master/home/.emacs.d/michael.org

#+BEGIN_SRC emacs-lisp 

#+END_SRC

* Org-mode tutorials 

  https://orgmode.org/worg/org-tutorials/

#+BEGIN_SRC emacs-lisp

#+END_SRC

